[
  {
    "科目名": "アルゴリズムとデータ構造",
    "開講学期": "春学期",
    "曜日・時限": "月曜日1講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "芳賀　博英",
    "到達目標": "学生は (1) 基本的なアルゴリズムとデータ構造の技法を身につけて，それを必要なプログラミング言語で実装できるようになる． (2) 既存のアルゴリズムとデータ構造を利用する場合には，その適・不適を適切に判断できるようになる．",
    "概要": "本講義では， プログラミングの初級を学習した人を対象として， より良いプログラムを作成するための必須の内容であるアルゴリズムとデータ構造についての基礎的な講義を行います。 プログラミングとは現実の世界の問題をコンピュータを使って解くことです.従って計算手順をコンピュータが実行できる形式で表さなければいけません．この計算手順がアルゴリズムです. 一方データ構造とは， 現実の問題をコンピューターの中でどのように表現するかという技法です. 本講義では膨大な内容を含むアルゴリズムとデータ構造のうち，現実の世界を表現するときによく使われる配列，リスト，ツリーというデータ構造，およびソート(並べ替え)とサーチ(検索)を中心とし，関連する内容について講義をします.またアルゴリズムを考える時に重要な計算の手間(計算の複雑さあるいは計算量とも言います)についても講義を行います. この講義ではたくさんのプログラム例を示し，また皆さんにも作ってもらいます．アルゴリズムは理論だけを勉強しても，実際の役にはたちませんが，アルゴリズムを知らずに問題を（効率よく）解くことも不可能です．ですから，理論と実装の両方について学びます． この講義では実装言語として Java を用います．またプログラミングの課題を出題します．ですから Javaの中級レベルの知識が必須です． またプログラミング課題を実行するための環境（コンパイラまたはIDE）も不可欠です．ただしプログラミング課題ではC/C++/C#を利用しても構いません．",
    "成績評価基準": [
      {
        "項目": "中間評価",
        "割合": "30%",
        "詳細": "7回目までの講義の内容が理解できているかどうか．"
      },
      {
        "項目": "期末試験",
        "割合": "30%",
        "詳細": "講義全般の内容が理解できているかどうか．"
      },
      {
        "項目": "プログラミング課題",
        "割合": "40%",
        "詳細": "指示されたプログラムが正しく動作しているかどうか．講義ではJavaを使いますが，プログラミング演習で使う言語は，C/C+/C#/Javaのいずれでも構いません．"
      }
    ],
    "成績評価結果": {
      "登録者数": "32",
      "A": "21.9",
      "B": "12.5",
      "C": "25.0",
      "D": "12.5",
      "F": "28.1",
      "他": "0.0",
      "評点平均値": "1.9",
      "備考": ""
    }
  },
  {
    "科目名": "オペレーティングシステム",
    "開講学期": "秋学期",
    "曜日・時限": "金曜日2講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "小野　景子",
    "到達目標": "（知識）OSが持つ抽象化の概念について学び，様々なコンピュータの効率的な利用法をソフトウェア開発で活用できるようになる． （技能）OSの基本的な機構を理解する過程で，プロセスやスレッドを活用するプログラミング技術を学び，応用できるようになる． （態度）OSによる多数のデバイスとプロセスの制御手順を学び，システムを構成する主体としてのコンピュータを意識できるようになる．",
    "概要": "本講義では，基本ソフトウェアの一種であるオペレーティングシステム（OS）について学ぶ．携帯電話やゲーム機を含め，多機能化が進み，多様化がますます加速する現代のコンピュータにおいては，OSに関する知識は無くてはならないものとなっている．そのため，本講義では古典的なOSを対象とし，その概念と実装技術について基礎から理解することを目的とする．実際に利用されるOSの話題にも触れ，その役割について具体的なイメージを掴み，応用する能力を身につける，講義内容の区切りには演習問題に取り組み，知識を技術として身に付ける．",
    "成績評価基準": [
      {
        "項目": "平常点",
        "割合": "20%",
        "詳細": "講義資料の閲覧状況および講義後の確認課題，予習・復習状況を通し，理解の深化を図ると同時に理解度を評価する．"
      },
      {
        "項目": "課題レポート2回",
        "割合": "80%",
        "詳細": "コマンドやプログラミングにより，OSの基本機構，プロセスやスレッドの理解度および活用ができるかを評価する"
      }
    ],
    "成績評価結果": {
      "登録者数": "105",
      "A": "18.1",
      "B": "23.8",
      "C": "22.9",
      "D": "13.3",
      "F": "21.9",
      "他": "0.0",
      "評点平均値": "2.0",
      "備考": ""
    }
  },
  {
    "科目名": "コラボレーション工学",
    "開講学期": "秋学期",
    "曜日・時限": "水曜日2講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "大久保　雅史",
    "到達目標": "コラボレーションの基本となる人のコミュニケーションについて理解できるようになる．さらに，対面・非対面，同期・非同期における各種のコラボレーション支援について知ることで，この分野の将来的なビジョンについて考えられるようになる．",
    "概要": "コンピュータや通信技術の発展にともない，サイバースペースやグループウェアをはじめする人と人あるいは人とコンピュータや機械との協調的創造活動を支援するシステムの研究・開発が盛んに行われている。これらのシステムは時間的・空間的な同期性からいくつかのパターンに分類できる。さらに，それぞれのコラボレーション支援の技術的な問題点はシステムの目的によって異なっている。たとえば，時間的・空間的に離れた複数の人が情報を共有しながら効率よく創造的な共同作業を進めていくコラボレーション支援システムでは，コミュニケーションとコオペレーションの2つのインタラクションを支援する必要がある。本講義では，様々なタイプのコラボレーション支援システムの概説と人と人のコラボレーションや人の創造的活動を支援する要素技術について講述する。また，グループによるワークショップをいくつか行い，コラボレーションの本質を実体験する。",
    "成績評価基準": [
      {
        "項目": "平常点（クラス参加，発表，グループ作業の成果等）",
        "割合": "15%",
        "詳細": "出席をとる。大幅な遅刻は欠席とみなす。"
      },
      {
        "項目": "小テスト，レポート",
        "割合": "25%",
        "詳細": "講義の理解を深めるために授業中のテストやレポートを課す。"
      },
      {
        "項目": "総括",
        "割合": "60%",
        "詳細": "講義の内容の基礎からその応用までを総括する。"
      },
      {
        "項目": "特記事項",
        "割合": "",
        "詳細": "講義内容の理解度を上記に述べる方法で総合的に判断する。"
      }
    ],
    "成績評価結果": {
      "登録者数": "119",
      "A": "58.0",
      "B": "19.3",
      "C": "11.8",
      "D": "4.2",
      "F": "6.7",
      "他": "0.0",
      "評点平均値": "3.2",
      "備考": ""
    }
  },
  {
    "科目名": "コンパイラ",
    "開講学期": "春学期",
    "曜日・時限": "金曜日1講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "芳賀　博英",
    "到達目標": "学生は (1) コンパイラの基本的な構造が理解できるようになる． (2) コンパイラ生成ツールを使って，字句解析，構文解析のプログラムを開発できるようになる． (3) コード生成部分のうちで，制御構造，関数呼び出しのコード生成の手順を理解できるようになる．",
    "概要": "この講義では，コンパイラ生成系を利用して，言語処理系を開発することによって，コンパイラの基礎を習得します。使用する生成系はYaccとLex（実際はそのフリーソフト版であるBisonとFlex）であり，このツールを用いて，C言語のサブセット的な言語のコンパイラ（字句解析系，構文解析系，コード生成系）の開発を行います。 講義では最初にコンパイラの基礎，正規表現，形式文法，上向き構文解析法を復習し，そのあとYaccの説明を行います。さらに字句解析系を生成するLexについて述べ，仮想スタックマシンの概要を説明します。その後簡単な算術式を記述できる言語(CalcL)のコンパイルから開発して，変数を扱える言語(ExprL)，制御構造を持つ言語(CntlL)，関数定義と関数呼び出しが可能な言語(FuncL)のコンパイル法を説明します。 YaccおよびLexはC言語のプログラムを生成するので，本講義の受講にはC言語の基本的な知識が必須です。具体的には，基本的なデータ構造，構造体，ポインタ，共用体，関数定義などのレベルです．またYaccとLexあるいはBisonとFlexが動作する環境（Unix環境もしくはCygwin環境）を 自前で準備することが必須です． 大学設置のPCでは演習課題は実行できません．",
    "成績評価基準": [
      {
        "項目": "プログラミング課題",
        "割合": "50%",
        "詳細": "各回で指定された機能が実現できているかどうか。スケジュールで(*)印の付いている回を予定．"
      },
      {
        "項目": "期末試験",
        "割合": "50%",
        "詳細": "講義の内容全般が理解できているかどうか．"
      }
    ],
    "成績評価結果": null
  },
  {
    "科目名": "コンピュータグラフィックス",
    "開講学期": "秋学期",
    "曜日・時限": "木曜日2講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "渡部　広一",
    "到達目標": "CGにおける基礎理論を理解できるようになる。 CGにおける画像生成手法や物体表現法を習得できるようになる。 CGにおける各種計算が出来るようになる。",
    "概要": "コンピュータ・グラフィックス（CG）とは，「コンピュータによりデータを処理し，画像として出力する技術」，または，「作成された画像そのもの」を指す。本講義では，CGにおける基礎理論，ならびに，画像生成手法，対象物体の表現方法などについて述べる。すなわち，CGにおける基本的考え方の理解が目標である。",
    "成績評価基準": [
      {
        "項目": "演習レポート",
        "割合": "60%",
        "詳細": "各回の講義内容の理解度の確認（相談可）"
      },
      {
        "項目": "期末試験",
        "割合": "40%",
        "詳細": "講義内容全体にわたっての理解度の確認（相談不可！）"
      }
    ],
    "成績評価結果": {
      "登録者数": "128",
      "A": "22.7",
      "B": "26.6",
      "C": "25.8",
      "D": "10.2",
      "F": "14.8",
      "他": "0.0",
      "評点平均値": "2.3",
      "備考": ""
    }
  },
  {
    "科目名": "コンピュータネットワーク",
    "開講学期": "春学期",
    "曜日・時限": "水曜日2講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "土屋　誠司",
    "到達目標": "（知識）情報処理技術者試験であるネットワークスペシャリスト合格に向けた基礎的な幅広い知識を習得できるようになる． （技能）コンピュータネットワークに関する一般的な問題をハードウェア，ソフトウェアの両面から総合的に解決できるようになる． （態度）様々なシステムをコンピュータネットワークの観点から捉えることができるようになる．",
    "概要": "現在の情報システムは，コンピュータと情報通信技術が高度に融合され複雑なものになっている．本講義では，コンピュータネットワークを構築するためのコンピュータ技術，情報通信技術についてハードウェア，ソフトウェアの両面から学び，コンピュータネットワーク技術に関する幅広い基礎力を養う． なお，企業内研究所での勤務経験を有する教員が，当該研究所で習得した技術を基礎とした講義を行っている．",
    "成績評価基準": [
      {
        "項目": "提出物（ノート，レポートなど）",
        "割合": "90%",
        "詳細": "講義内容が理解できているか評価する"
      },
      {
        "項目": "その他",
        "割合": "10%",
        "詳細": "受講状況などを評価する"
      }
    ],
    "成績評価結果": {
      "登録者数": "89",
      "A": "15.7",
      "B": "27.0",
      "C": "30.3",
      "D": "20.2",
      "F": "6.7",
      "他": "0.0",
      "評点平均値": "2.2",
      "備考": ""
    }
  },
  {
    "科目名": "コンピュータ基礎実習",
    "開講学期": "秋学期",
    "曜日・時限": "金曜日2講時",
    "単位数": 1,
    "授業形態": "実習",
    "実施方法": "面接/Face-to-face",
    "教授名": "加藤　恒夫",
    "到達目標": "（知識）基本情報技術者試験で出題されるアセンブラ言語の問題を解答できるようになる． （技能）Microsoft Excelのマクロ機能ならびにVBAを使いこなすことができるようになる． （態度）コンピュータをハードウェアとソフトウェアの両面から理解できるようになる．",
    "概要": "コンピュータの内部構造および動作原理の基礎的理解のために，アセンブラ言語（CASL II）によるプログラミング実習を行う．また，実務を効率的に行うために有効なMicrosoft Excelのマクロ機能ならびにVBAを習得する． 通信会社の研究所での研究開発の経験を有する教員が，実社会でのコンピュータ利用の実態を踏まえて，実習を行う．",
    "成績評価基準": [
      {
        "項目": "実習レポート",
        "割合": "30%",
        "詳細": "各回の実習課題に対する提出物の完成度"
      },
      {
        "項目": "総合学習(1)(2)",
        "割合": "70%",
        "詳細": "(1)はアセンブラの，(2)はExcelマクロ・VBAの理解度確認"
      }
    ],
    "成績評価結果": {
      "登録者数": "80",
      "A": "22.5",
      "B": "36.3",
      "C": "18.8",
      "D": "17.5",
      "F": "5.0",
      "他": "0.0",
      "評点平均値": "2.5",
      "備考": ""
    }
  },
  {
    "科目名": "センシング制御工学",
    "開講学期": "秋学期",
    "曜日・時限": "水曜日4講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "橋本　雅文",
    "到達目標": "(1)運動量を計測するセンサの基礎を習得できる． (2)センサに関連する誤差の表現法を理解できるようになる． (3)センサ情報をコンピュータに取り入れる方法を習得できる． (4)センサ情報に基づく様々な信号処理手法の基礎を習得できる．",
    "概要": "「センシング」は注目する情報を取得し，「制御」はその情報に基づいた操作による行動を意味する。センシングによりシステムの状態を信頼性高く認識することは，それを正確に制御する基礎となる。本講義ではロボットやメカトロニクスシステムでのセンシングに不可欠な基礎的事項を修得する。",
    "成績評価基準": [
      {
        "項目": "平常点（クラス参加，発表，グループ作業の成果等）",
        "割合": "10%",
        "詳細": "毎回，小テストを行い，出欠とともに講義内容の理解度を確認する。なお，大幅な遅刻は欠席とみなす。"
      },
      {
        "項目": "レポート課題",
        "割合": "5%",
        "詳細": "複数回のレポートを課し，講義内容の理解度を評価する。レポートの解説は授業で行う。"
      },
      {
        "項目": "期末試験",
        "割合": "85%",
        "詳細": "講義内容の理解度と論理的思考力を評価する。期末試験の解説は授業講評で行う。"
      }
    ],
    "成績評価結果": {
      "登録者数": "108",
      "A": "25.0",
      "B": "21.3",
      "C": "12.0",
      "D": "17.6",
      "F": "24.1",
      "他": "0.0",
      "評点平均値": "2.1",
      "備考": ""
    }
  },
  {
    "科目名": "ソフトウェア工学",
    "開講学期": "春学期",
    "曜日・時限": "月曜日1講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "小野　景子",
    "到達目標": "授業において学習内容に関する演習が出されるが，十分理解をし，毎回の演習に十分に解答できる様に努力する必要がある． 後半の実習では，「CDレンタルショップ」におけるレンタルと返却に関する業務処理をUMLで設計し，その後，Javaを用いて実装する．",
    "概要": "「情報システム工学」で得た知識をもとに，システム開発の基礎技術に関し更に理解を深め，IT技術者の技量に左右されるシステム開発の生産性や品質向上に必要な技術を習得する．具体的には，UML静的モデル（クラス図）の設計およびJavaを用いた静的モデルの実装技術を身につけることを目標とする．　Javaプログラミングができることを前提とする．",
    "成績評価基準": [
      {
        "項目": "平常点(出席，クラス参加)",
        "割合": "30%",
        "詳細": "毎回の実習問題による評価．"
      },
      {
        "項目": "UMLを使ったオブジェクト指向開発の実習に関するレポート",
        "割合": "20%",
        "詳細": "UMLによる設計による評価．"
      },
      {
        "項目": "UMLを使ったオブジェクト指向開発の実習に関するJavaでの実装",
        "割合": "50%",
        "詳細": "上記の設計に基づくJavaによる実装による評価．"
      }
    ],
    "成績評価結果": {
      "登録者数": "70",
      "A": "11.4",
      "B": "25.7",
      "C": "24.3",
      "D": "21.4",
      "F": "17.1",
      "他": "0.0",
      "評点平均値": "1.9",
      "備考": ""
    }
  },
  {
    "科目名": "ディジタル信号処理",
    "開講学期": "春学期",
    "曜日・時限": "水曜日2講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "加藤　恒夫",
    "到達目標": "知識：アナログ信号のディジタル化における留意点，スペクトル分析，コンボリューション，ディジタルフィルタ等の基本的な概念を理解する。 技能：ディジタル信号処理の基本的な手法，z変換と離散的フーリエ変換，を実際の信号に適応して計算できるようになる。 態度：ディジタル信号を時間領域の波形で捉えるだけでなく，周波数領域のスペクトルでも捉えられるようになる。",
    "概要": "本講義では，ディジタル信号処理の基礎，すなわち，標本化・量子化，離散信号のスペクトル分析，コンボリューション，ディジタルフィルタ等を学ぶ。これらは画像や音声をはじめ，自然界のアナログ信号をコンピュータに取り込み処理を行う，あるいは通信を行ううえで欠かせない技術である。講義内容で特に大切なのは，時間領域と周波数領域の関係の概念的な理解であり，これを強調して講義を進める。「解析学」と「フーリエ解析」が履修済みであることを想定しているが，まずアナログの信号処理のおさらいから始める。 通信会社の研究所での研究開発の経験を有する教員が，ディジタル信号処理技術の実社会における応用を踏まえて解説する．",
    "成績評価基準": [
      {
        "項目": "講義各回の提出課題",
        "割合": "30%",
        "詳細": "概念の理解，基本知識の確認"
      },
      {
        "項目": "期末試験",
        "割合": "70%",
        "詳細": "概念の理解，テクニックの応用"
      }
    ],
    "成績評価結果": {
      "登録者数": "86",
      "A": "17.4",
      "B": "22.1",
      "C": "27.9",
      "D": "15.1",
      "F": "17.4",
      "他": "0.0",
      "評点平均値": "2.1",
      "備考": ""
    }
  },
  {
    "科目名": "データベースシステム",
    "開講学期": "春学期",
    "曜日・時限": "月曜日2講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "小野　景子",
    "到達目標": "１．受講者はシステムに組み込む知的性質に関して高度な知識を獲得し，システムの知能を評価する上で十分な能力を獲得できる。 ２．受講者はシステムに組み込む知能のメカニズムについて，その機能と性能に関して高度で詳細な議論ができるようになる。 ３．受講者は独創的な知的システムを考案する演習を通じて，発想能力を養うことができる。 ４．受講者は，問題解決には幅広い高度な知識が必要であることを理解できるようになり，新たな情報収集の習慣ができるようになる。",
    "概要": "システムエンジニアを目指す学生には受講を強く勧める。その理由は次の通りである。 1. コンピュータの応用分野で最も重要なのは，科学技術計算，通信，そしてデータベースである。特にビジネスの分野でのコンピュータの利用はほとんどがデータベースに関連する。このため，データベースについての基本的知識を学び，現実世界のデータをデータベース化する方法を考え，そして多くのデータベースを効果的に利用する方法を知ることはシステムエンジニアにとって大変重要なことである。 2. データベースを行うには現実世界のモデル化という操作が必要である。このとき，現実世界の中から何を抽出するかを考える。そのためには，データベースの利用において何が要求されているのかというユーザーオリエンテッドな考え方が最も重要となる。この講義では，システムエンジニアにとって不可欠であるこのような考え方を学ぶ。 講義の内容は次の通りである。 コンピュータの応用分野で最も重要なのは，科学技術計算，通信，そしてデータベースである。特にビジネスの分野でのコンピュータの利用はほとんどがデータベースに関連する。本講義では機能の高いデータベースシステムとしての関係データベースの考え方および基本的な技法について論じる。特に，データモデルと実世界のモデリング，データベースの設計とスキーマ，データベース言語SQL，物理的なデータの格納方式，問合せ処理，同時実行制御，および障害回復などについて述べる。特に，データベースの外部設計において重要となる現実世界のモデリングの方法を詳述し，内部設計において重要となるリレーショナルデータベースモデルの正規化について詳述する。 なお，講義の内容を完全に理解するには毎回の講義の最初に行う小テストに対して前日までに復習することが重要である。",
    "成績評価基準": [
      {
        "項目": "小テスト",
        "割合": "30%",
        "詳細": "毎回の講義で出される小テストにより評価する．"
      },
      {
        "項目": "レポート",
        "割合": "20%",
        "詳細": "SQLと正規化に関するレポートにより評価する．"
      },
      {
        "項目": "期末試験",
        "割合": "50%",
        "詳細": ""
      }
    ],
    "成績評価結果": {
      "登録者数": "183",
      "A": "6.6",
      "B": "17.5",
      "C": "33.3",
      "D": "21.9",
      "F": "20.8",
      "他": "0.0",
      "評点平均値": "1.7",
      "備考": ""
    }
  },
  {
    "科目名": "ネットワークシステム構成論",
    "開講学期": "秋学期",
    "曜日・時限": "水曜日3講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "佐藤　健哉",
    "到達目標": "具体的には次のような項目の理解があげられる． ・ネットワーク分散システム（クラウドコンピューティング，P2P，グリッド） ・動画や音声などのネットワークを利用したストリームデータ配信 ・ネットワークにおける QoS技術 ・情報源符号化（JPEG，MPEGなど） ・インターネットにおける帯域制御 ・データリンク層における QoS の役割 ・ネットワークセキュリティ技術",
    "概要": "インターネットを代表とするコンピュータネットワークは日進月歩で進化を続けており，次々と新しい技術が登場している．このような状況において，特に，動画や音声などのストリームデータの配信をターゲットとしたネットワーク技術の発展はめざましいものがある．ネットワーク分散システムという観点から，ネットワークアーキテクチャ，ストリームデータ配信，セキュリティについての基本技術から，携帯電話や無線LANによる伝送方式，大規模データ処理などの現在検討中の最新技術まで，それらの仕組みと動作原理について学習する． 企業においてコンピュータネットワークの開発経験のある教員が，インターネットにおける事象の実例を交えて，ネットワークシステムの構成を説明する．また，最新技術に関しては，ゲストスピーカとして企業からエンジニアを呼んで解説を担当する．",
    "成績評価基準": [
      {
        "項目": "平常点（クラス参加，発表，グループ作業の成果等）",
        "割合": "30%",
        "詳細": "各項目の講義内容の理解度を確認するため，講義に関する課題およびアンケートの提出を課す．"
      },
      {
        "項目": "小レポート",
        "割合": "20%",
        "詳細": "講義内容の応用に関して，独自の問題解決能力を評価する。"
      },
      {
        "項目": "期末試験",
        "割合": "50%",
        "詳細": "全体を通しての講義内容の理解度を評価する．"
      },
      {
        "項目": "特記事項",
        "割合": "",
        "詳細": "「情報ネットワーク」あるいはそれに類する科目を履修し，OSI参照モデル，ネットワークプロトコル全般，および，TCP/IPに関する基本知識を習得していること．"
      }
    ],
    "成績評価結果": {
      "登録者数": "155",
      "A": "21.9",
      "B": "36.1",
      "C": "30.3",
      "D": "7.1",
      "F": "4.5",
      "他": "0.0",
      "評点平均値": "2.6",
      "備考": ""
    }
  },
  {
    "科目名": "ネットワーク応用",
    "開講学期": "秋学期",
    "曜日・時限": "火曜日2講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "小板　隆浩",
    "到達目標": "インターネットでのアプリケーションの作成方法を学び，インターネットアプリケーション開発の基礎技術を応用できるようになる．",
    "概要": "インターネットは，デジタル情報なら何でも交換できる情報インフラストラクチャであり，新しいアプリケーションを自由に開発し，使うことが可能な環境である。インターネットは，既存のアプリケーションだけではなく，新しいアプリケーションを自分自身で作りあげることが可能な開かれたインフラストラクチャである。例えば，Webはフランスの高エネルギー物理学の研究所の研究者が作成した非常に単純なアプリケーションが起源であり，約1年という短い間でインターネットの最も重要なアプリケーションとなった。本講義では，インターネットでのアプリケーションの作成方法を学び，インターネットアプリケーション開発の基礎技術を習得する。",
    "成績評価基準": [
      {
        "項目": "平常点（出席，演習の成果等）",
        "割合": "40%",
        "詳細": "演習課題の成績等を総合的に評価する。"
      },
      {
        "項目": "中間レポート",
        "割合": "20%",
        "詳細": "講義内容の理解度を評価する。"
      },
      {
        "項目": "期末レポート",
        "割合": "40%",
        "詳細": "講義内容の理解度を評価する。"
      }
    ],
    "成績評価結果": {
      "登録者数": "63",
      "A": "60.3",
      "B": "17.5",
      "C": "12.7",
      "D": "3.2",
      "F": "6.3",
      "他": "0.0",
      "評点平均値": "3.2",
      "備考": ""
    }
  },
  {
    "科目名": "パターン認識",
    "開講学期": "秋学期",
    "曜日・時限": "火曜日1講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "加藤　恒夫",
    "到達目標": "知識：誤差評価，学習，精度改善のための特徴量の線形変換等の基礎的な技法に加えて，音声認識等の実際的な応用にどのようなパターン認識技術が使われているのかを理解する。 技能：線形代数の応用によりパターン認識の課題を解く技能を修得する。 態度：パターン認識の基礎，線形代数の応用方法を理解し，課題に対して適切な設計を行う習慣・姿勢を身に付ける。",
    "概要": "本講義では，統計的パターン認識の基礎，すなわち，線形識別，パーセプトロン，誤差評価と学習，ニューラルネットワーク，特徴量の線形変換等を学ぶ。これらは，音声認識，画像認識，最近AIと呼ばれる様々な機械学習に発展していく理論の基礎をなす技術である。講義の前半では基本的なパターン認識の考え方と学習方式を学び，後半は認識性能を上げるための特徴空間の変換等を学ぶ。 通信会社の研究所での研究開発の経験を有する教員が，パターン認識技術の実社会における応用を踏まえて解説する．",
    "成績評価基準": [
      {
        "項目": "講義各回の提出課題",
        "割合": "30%",
        "詳細": "概念の理解，基本知識の確認"
      },
      {
        "項目": "期末試験",
        "割合": "70%",
        "詳細": "概念の理解，テクニックの応用"
      }
    ],
    "成績評価結果": {
      "登録者数": "51",
      "A": "21.6",
      "B": "17.6",
      "C": "25.5",
      "D": "19.6",
      "F": "15.7",
      "他": "0.0",
      "評点平均値": "2.1",
      "備考": ""
    }
  },
  {
    "科目名": "フーリエ解析",
    "開講学期": "秋学期",
    "曜日・時限": "火曜日2講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "程　俊",
    "到達目標": "この講義の到達目標は，理工学の諸問題で現れる現象を時間領域と周波数領域の両面から見る能力を養うこと，および線形システムの解析を理解することである．",
    "概要": "通信工学，信号処理，パターン認識，不規則信号の解析などで広く応用されているフーリエ級数，フーリエ変換とラプラス変換について講義する。この講義の出発点は三角関数の加法定理である。 フーリエ級数は周期関数の三角関数系による級数展開であり，フーリエ変換は非周期関数のスペクトル表示である。ラプラス変換はフーリエ変換の特別なもので，常微分方程式で表現される線形システムの過渡応答を求める道具である。 民間の研究機関および企業内研究所での勤務経験を有する教員が，実務で習得した技術を基礎とした講義を行っている．",
    "成績評価基準": [
      {
        "項目": "期末試験",
        "割合": "80%",
        "詳細": "フーリエ級数，フーリエ変換，ラプラス変換を使って現象を解釈できる能力を確める。"
      },
      {
        "項目": "小レポート，演習など",
        "割合": "20%",
        "詳細": "講義内容が理解できているか評価する"
      }
    ],
    "成績評価結果": {
      "登録者数": "80",
      "A": "37.5",
      "B": "20.0",
      "C": "12.5",
      "D": "16.3",
      "F": "13.8",
      "他": "0.0",
      "評点平均値": "2.5",
      "備考": ""
    }
  },
  {
    "科目名": "プログラミング言語",
    "開講学期": "秋学期",
    "曜日・時限": "木曜日1講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "芳賀　博英",
    "到達目標": "学生は (1) コンピュータの基本的なアーキテクチャを理解できるようになる． (2) プログラミング言語の基本要素と，それらが実際のコンピュータの上でどのように実行されるかについて理解できるようになる．",
    "概要": "本講義ではプログラミング言語に関する基本的な概念を述べます。プログラミング言語はコンピュータハードウエアへの指示・命令という側面と，アルゴリズムの記述という2つの側面を持っています．本講義では，この2つについて，その基礎的な部分を述べます．従って，本講義は前半と後半に分かれることになります． 前半ではコンピュータ・ハードウエアの論理的な構造に基づくプログラミング言語であるアセンブリ言語について講義をします．これによって，ハードウエアの基礎的な知識の習得と，それに基づくプログラミング言語の基本的な機能の理解を目指します．取り上げるCPUはMIPS社のR2000/3000というRISCチップです．現在最も広く使われているCPUであるIntelのx86系(+Windows OS)に比べてシンプルな構成であり，ハードウエア構成とプログラミング言語の対応を理解するのに適していると判断しました． 後半では，アルゴリズムの記述という観点から，C言語やJavaなどの手続き型言語以外の新しい言語について講義をします．講義する言語は，関数型言語Haskell，および論理型言語Prologです．これらの言語は，すでに学んでいるCやJavaとは異なる考え方を持つ言語であり，たぶんほとんどの学生さんが知らない言語だと思います．これらの言語は，Cなどの手続き型言語がアルゴリズムのHow(どうする？)を記述するのに対して，What(何？)を記述しており，より高次なレベルからのアルゴリズムの記述であると言えます．これらの言語を学ぶことにより，アルゴリズムというものがどういうものであり，それをどう表現するか，という観点の知識を身につけます． 講義の前半ではC言語の基礎的な知識を前提とします．また後半では，関数型言語と論理型言語を用いて，初歩的なプログラムを作成します．従って，HaskellとPrologの処理系をインストールする必要があるので， 各自PCが使える環境を準備することが必須です ．PCはWindows，Mac，Linuxのいずれでも結構です． 大学にあるPCではHaskell，Prologのいずれも実行することはできません ．",
    "成績評価基準": [
      {
        "項目": "中間評価",
        "割合": "50%",
        "詳細": "アセンブリ言語が理解できているかどうか"
      },
      {
        "項目": "期末試験",
        "割合": "50%",
        "詳細": "関数型言語，論理型言語の基礎が理解できているかどうか．"
      }
    ],
    "成績評価結果": null
  },
  {
    "科目名": "メカトロニクス基礎",
    "開講学期": "春学期",
    "曜日・時限": "水曜日4講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "橋本　雅文",
    "到達目標": "(1)メカトロニクスの基本的な考え方が理解できるようになる． (2)メカトロニクスのハードウェア要素の基礎が理解できるようになる． (3)信号処理や制御の基礎を習得できる．",
    "概要": "メカトロニクスシステムやロボットはハードウェア（センサ，アクチュエータ，コンピュータ，メカニズム，インタフェースなど）とソフトウェア（計測制御などの情報処理）とが有機的に統合化されたシステムである。本講義ではメカトロニクスシステムの構成要素の基本的な解説を行うとともに，メカトロニクスシステムに不可欠な離散時間での制御や信号処理の基礎を修得する。本科目は今後のロボット・メカトロニクス関連科目である「センシング制御工学」と「ロボティクス」の入門と位置づけられる。",
    "成績評価基準": [
      {
        "項目": "平常点（クラス参加，発表，グループ作業の成果等）",
        "割合": "10%",
        "詳細": "毎回，小テストを行い，出欠とともに講義内容の理解度を確認する。なお，大幅な遅刻は欠席とみなす。"
      },
      {
        "項目": "レポート課題",
        "割合": "5%",
        "詳細": "複数回のレポートを課し，講義内容の理解度を評価する。レポートの解説は授業で行う．"
      },
      {
        "項目": "期末試験",
        "割合": "85%",
        "詳細": "講義内容の理解度と論理的思考力を評価する。期末試験の解説は授業講評で行う．"
      }
    ],
    "成績評価結果": {
      "登録者数": "109",
      "A": "37.6",
      "B": "13.8",
      "C": "19.3",
      "D": "11.0",
      "F": "18.3",
      "他": "0.0",
      "評点平均値": "2.4",
      "備考": ""
    }
  },
  {
    "科目名": "ロボティクス",
    "開講学期": "春学期",
    "曜日・時限": "水曜日5講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "橋本　雅文",
    "到達目標": "(1)マニピュレータ（アームロボット）と移動ロボットのシステム構成が理解できるようになる． (2)ロボットを動かす基本的な考え方が理解できるようになる． (3)ロボット制御の基礎が理解できるようになる．",
    "概要": "本講義はロボティクス（ロボット工学）の入門として，腕型ロボット（アームロボット）と移動ロボットについて述べる。ロボットのシステム構成，運動学，運動制御の基礎を学ぶ。 講義科目「メカトロニクス基礎（2年次春学期）」と「センシング制御工学（2年次秋学期）」を受講済であることが望ましい。",
    "成績評価基準": [
      {
        "項目": "平常点（クラス参加，発表，グループ作業の成果等）",
        "割合": "10%",
        "詳細": "毎回，小テストを行い，出欠とともに講義内容の理解度を確認する。なお，大幅な遅刻は欠席とみなす。"
      },
      {
        "項目": "レポート課題",
        "割合": "5%",
        "詳細": "複数回のレポートを課し，講義内容の理解度を評価する。レポートの解説は授業で行う。"
      },
      {
        "項目": "期末試験",
        "割合": "85%",
        "詳細": "講義内容の理解度と論理的思考力を評価する。期末試験の解説は授業講評で行う。"
      }
    ],
    "成績評価結果": {
      "登録者数": "73",
      "A": "32.9",
      "B": "20.5",
      "C": "15.1",
      "D": "15.1",
      "F": "16.4",
      "他": "0.0",
      "評点平均値": "2.4",
      "備考": ""
    }
  },
  {
    "科目名": "ワイヤレス通信",
    "開講学期": "秋学期",
    "曜日・時限": "月曜日2講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "程　俊",
    "到達目標": "（知識）電波伝搬の特徴を理解した上で，ワイヤレス通信の要素技術を学習し，通信システムの構成を理解できるようになる。 （態度）通信システムの設計，開発に必要な幅広い知識を探求できるようになる． （技能）通信工学的な思考過程に力を注ぎ，論理的な思考方法を考案できるようになる．",
    "概要": "本講義では，情報通信基盤の一環としての通信システムの体系的な学習を通じて，通信技術に挑戦する能力を養うことを目的とする。ディジタル変復調，スペクトル拡散通信，アンテナ，などの通信要素技術，及びそれらの技術を用いて構成された通信システムを学習する。民間の研究機関および企業内研究所での勤務経験を有する教員が，実務で習得した技術を基礎とした講義を行っている。",
    "成績評価基準": [
      {
        "項目": "期末試験",
        "割合": "80%",
        "詳細": "ワイヤレス通信に関する基礎的知識の習得について評価する。"
      },
      {
        "項目": "小レポート，演習など",
        "割合": "20%",
        "詳細": "講義内容が理解できているか評価する。"
      }
    ],
    "成績評価結果": {
      "登録者数": "122",
      "A": "58.2",
      "B": "15.6",
      "C": "4.9",
      "D": "10.7",
      "F": "10.7",
      "他": "0.0",
      "評点平均値": "3.0",
      "備考": ""
    }
  },
  {
    "科目名": "不規則信号論",
    "開講学期": "春学期",
    "曜日・時限": "木曜日1講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "木村　共孝",
    "到達目標": "不規則現象をその平均的性質で特徴づけることができる．これを理解することがこの講義の目標である．",
    "概要": "情報伝送に必然的に存在する非予則性あるいは不規則性の理論と手法について講義する．不規則な現象の中に潜む「規則性」に基づいて不規則な現象の性質を明らかにする．この講義の前提科目は「フーリエ解析」である．具体的な内容は授業計画内に記されている．また，応用的な内容は，確率変数の相関，信号検出，信号のフィルタリングである．",
    "成績評価基準": [
      {
        "項目": "期末試験",
        "割合": "60%",
        "詳細": "不規則信号を扱うための基礎知識およびその応用に関する理解度を確かめる．"
      },
      {
        "項目": "レポート",
        "割合": "40%",
        "詳細": "講義の理解度を確認する．"
      }
    ],
    "成績評価結果": {
      "登録者数": "99",
      "A": "14.1",
      "B": "23.2",
      "C": "26.3",
      "D": "28.3",
      "F": "8.1",
      "他": "0.0",
      "評点平均値": "2.1",
      "備考": ""
    }
  },
  {
    "科目名": "卒業論文Ⅰ",
    "開講学期": "春集中",
    "曜日・時限": null,
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": null,
    "教授名": "藤田　倫弘",
    "到達目標": "各研究室において，与えられた課題あるいは自らの問題意識から設定した課題に対して，解決すべき技術的問題を発見し，その解決法を自ら探究し，適切に問題解決を図る手順が理解できるようになる．また，研究室内ゼミあるいは学会でのプレゼンテーションを通じて，自らの考えを適切に表現し聴講者の理解を得るためのプレゼンテーション能力を培うことができる．",
    "概要": "卒業論文の指導を受けるものは，配属された各研究室において卒業研究テーマに関する研究を行う．具体的な進め方については，各研究室の指導教員の指示に従い，研究計画を企画・立案した上で研究に取り組む． なお，企業内研究所での勤務経験を有する教員が，当該研究所で習得した技術を基礎とした卒業研究指導を行っている．",
    "成績評価基準": [
      {
        "項目": "日常的な研究の取り組み，卒業論文の提出，卒業論文発表会での発表により合否を判定する．",
        "割合": "100%",
        "詳細": "内容の新規性・努力度"
      }
    ],
    "成績評価結果": null
  },
  {
    "科目名": "卒業論文Ⅱ",
    "開講学期": "秋集中",
    "曜日・時限": null,
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": null,
    "教授名": "藤田　倫弘",
    "到達目標": "各研究室において，与えられた課題あるいは自らの問題意識から設定した課題に対して，解決すべき技術的問題を発見し，その解決法を自ら探究し，適切に問題解決を図る手順が理解できるようになる．また，研究室内ゼミあるいは学会でのプレゼンテーションを通じて，自らの考えを適切に表現し聴講者の理解を得るためのプレゼンテーション能力を培うことができる．",
    "概要": "卒業論文の指導を受けるものは，配属された各研究室において卒業研究テーマに関する研究を行う．具体的な進め方については，各研究室の指導教員の指示に従い，研究計画を企画・立案した上で研究に取り組む． なお，企業内研究所での勤務経験を有する教員が，当該研究所で習得した技術を基礎とした卒業研究指導を行っている．",
    "成績評価基準": [
      {
        "項目": "日常的な研究の取り組み，卒業論文の提出，卒業論文発表会での発表により合否を判定する．",
        "割合": "100%",
        "詳細": "内容の新規性・努力度"
      }
    ],
    "成績評価結果": null
  },
  {
    "科目名": "学外実習１－1",
    "開講学期": "秋集中",
    "曜日・時限": null,
    "単位数": 2,
    "授業形態": "実習",
    "実施方法": null,
    "教授名": "井上　馨",
    "到達目標": "【知識】受講生は，社会における実習先企業の役割を理解するだけでなく，海外の企業や大学におけるキャリア形成に対する考え方について日本との違いを理解し，自らのキャリア形成やグローバル人材とは何かについて考えることができるようになる。 【態度】受講生は，グローバルな視点に基づいて，社会人あるいは理系エンジニアとしての礼儀や作法，職業人意識を形成できるようになる。 【技能】受講生は，事前授業・オンライン英会話・英語研修＆海外実践インターンシップ・事後授業（報告会）を通して，一般的な英語のコミュニケーションやディスカッションができるようになる。",
    "概要": "本科目は，学外実習２への導入科目に位置づけられ，観光及び製造産業に注力しているセブ島にて実習体験をする。具体的には，フィリピンにおける経済特区・工場地帯において実習を行う「英語研修＆海外実践インターンシップ」に参加する。理工学部卒業生は，海外企業等で勤務する可能性があるため，本科目を通じて，日本と海外との風土，慣習，文化などの違いを肌で感じ，グローバルな人材とは何か，について考えるきっかけとなることも目的のひとつである。このため，現地スタッフとの交流促進をはかるために，事前英会話レッスン及び現地での初級ビジネス英語研修も実施する。また，事前および事後の授業を通した一連のプログラムにより，研修・実習へ目的や意識付け，振り返りを行うため，積極的に他の参加者と交流を深めることを求める。",
    "成績評価基準": [
      {
        "項目": "平常点(出席，クラス参加，グループ作業の成果等)",
        "割合": "50%",
        "詳細": "事前授業・オンライン英会話レッスン・海外実践インターンシップ・事後授業（報告会）への参加，受講態度等"
      },
      {
        "項目": "レポート課題および事後授業（報告会）での発表",
        "割合": "50%",
        "詳細": "レポート課題を要約し，事後授業（報告会）において英語で発表（日本語での発表や原稿の読み上げ等は評価対象外）"
      }
    ],
    "成績評価結果": null
  },
  {
    "科目名": "学外実習２",
    "開講学期": "秋集中",
    "曜日・時限": null,
    "単位数": 2,
    "授業形態": "実習",
    "実施方法": null,
    "教授名": "土屋　誠司",
    "到達目標": "・履修生は，実習を通して企業活動の一端を経験し，将来の職業観を明確に形成できるようになることが求められる。 ・履修生は，社会人あるいは職業人たる作法や礼儀，職業人意識を形成できるようになることが求められる。",
    "概要": "企業等で連続して2週間以上，指導者の監督のもとで当学科設置科目に関連する分野の技術等について実習する。 1.実習先は，履修者本人が企業等と交渉して決める。実習時期は春学期，秋学期のいずれでもかまわない。 2.企業等が履修者の実習を受け入れるに際し，依頼状等の文書が必要となる場合は科目担当者にこれを請求する。 3.実習先に通学するにあたって，交通機関の通学定期券が必要であれば，その旨を科目担当者に申し出る。 4.実習終了後，実習先から実習証明書（任意書式）を発行してもらい，実習成果報告書（下記参照）と共に科目担当者に提出する。 5.実習終了後，実習成果報告書を科目担当者に提出する。提出期限は1月20日とし，長さはA4レポート用紙で20枚程度とする。 6.履修登録は春学期に行い，秋学期の登録変更は認めない。 企業勤務経験を有する教員が，学外実習プログラムを運用する．",
    "成績評価基準": [
      {
        "項目": "実習態度",
        "割合": "50%",
        "詳細": "事前準備と実習態度を総合的に評価する。"
      },
      {
        "項目": "実習成果報告書",
        "割合": "50%",
        "詳細": "実習内容の理解及び記録の正確さ，報告書作成に伴う説明力等を総合的に評価する。"
      },
      {
        "項目": "特記事項",
        "割合": "",
        "詳細": "上記2項目に加え，実習証明書を合わせて，「合」，「否」判定を行う。"
      }
    ],
    "成績評価結果": null
  },
  {
    "科目名": "微分方程式Ⅰ",
    "開講学期": "秋学期",
    "曜日・時限": "水曜日3講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "藤井　慎一",
    "到達目標": "以下の項目について基本的問題が解けるようになる。 (1)微分方程式の初等解法 (2)単独定数係数微分方程式の解法 (3)２階微分方程式の定数変化法 (4)対角化可能な２ｘ２連立定数係数斉次線型微分方程式の解法",
    "概要": "次の項目について考察する。（1）常微分方程式の初等解法（求積法）（2）線型微分方程式の一般論および定数係数の場合の解法（3）連立線形微分方程式の一般論および定数係数の場合の解法。求積法では微分積分法の不定積分の知識を必要とする。また，線形微分方程式，連立線形微分方程式では充分な線形代数学の知識を必要とする。",
    "成績評価基準": [
      {
        "項目": "課題提出",
        "割合": "50%",
        "詳細": "授業で解説した計算問題の解法ができるかを見る。"
      },
      {
        "項目": "期末試験",
        "割合": "50%",
        "詳細": "授業で解説した計算問題の解法ができるかを見る。"
      }
    ],
    "成績評価結果": {
      "登録者数": "87",
      "A": "44.8",
      "B": "20.7",
      "C": "10.3",
      "D": "4.6",
      "F": "19.5",
      "他": "0.0",
      "評点平均値": "2.7",
      "備考": ""
    }
  },
  {
    "科目名": "微分方程式Ⅱ",
    "開講学期": "春学期",
    "曜日・時限": "水曜日3講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "藤井　慎一",
    "到達目標": "次の項目について基本的問題が解けるようになる. (1)対角化可能でない２ｘ２斉次定数係数連立微分方程式の解法 (2)逐次近似法 (3)級数による微分方程式の解法 (4)確定特異点をもつ微分方程式の解法 (5)定数係数２ｘ２連立微分方程式の平衡点の分類と解軌道を描くこと (6)線型連立微分方程式の平衡点の安定性の線型近似による判定 (7)リャプノフ関数による平衡点の安定性の判定",
    "概要": "次の項目について考察する。（1）微分方程式の初期値問題の解の存在定理と一意性定理，逐次近似法（2）級数による微分方程式の解法(3)確定特異点をもつ微分方程式（フロべニウスの方法）（4）二次元連立線型微分方程式の解軌道(5)非線型連立微分方程式の平衡点の安定性(6)極限周期軌道",
    "成績評価基準": [
      {
        "項目": "小レポート",
        "割合": "50%",
        "詳細": "授業で解説したのと同様の問題が解けるかを見る。"
      },
      {
        "項目": "期末試験",
        "割合": "50%",
        "詳細": "授業で解説したのと同様の問題が解けるかを見る。"
      }
    ],
    "成績評価結果": {
      "登録者数": "93",
      "A": "24.7",
      "B": "28.0",
      "C": "24.7",
      "D": "11.8",
      "F": "10.8",
      "他": "0.0",
      "評点平均値": "2.4",
      "備考": ""
    }
  },
  {
    "科目名": "応用数理統計学",
    "開講学期": "秋学期",
    "曜日・時限": "月曜日2講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "近原　鷹一",
    "到達目標": "知識・技能：母数の推定や仮説検定ができるようになる． 思考力・判断力・表現力：分析結果を適切に解釈できるようになる． 主体性・多様性・協働性：発展的な内容について自身で調査し解釈できるようになる．",
    "概要": "春学期の「数理統計学」で習得した知識をベースに，推定・仮説検定・分散分析の具体的な方法を学ぶ．",
    "成績評価基準": [
      {
        "項目": "レポート",
        "割合": "30%",
        "詳細": "講義内容に関するレポートの提出状況から評価する．"
      },
      {
        "項目": "中間試験",
        "割合": "30%",
        "詳細": "講義内容の理解度をチェックする．"
      },
      {
        "項目": "期末試験",
        "割合": "40%",
        "詳細": "講義内容の理解度をチェックする．"
      }
    ],
    "成績評価結果": {
      "登録者数": "98",
      "A": "44.9",
      "B": "26.5",
      "C": "18.4",
      "D": "5.1",
      "F": "5.1",
      "他": "0.0",
      "評点平均値": "3.0",
      "備考": ""
    }
  },
  {
    "科目名": "応用数理解析",
    "開講学期": "春学期",
    "曜日・時限": "月曜日3講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "高橋　和彦",
    "到達目標": "学生が，動的な現象やシステムを数理的にモデル化する手法と解析手法を身につけることができるようになることを目標とする．",
    "概要": "微分方程式や偏微分方程式によって記述される動的な現象やシステムを対象として取り上げ，その解析方法について講述する。",
    "成績評価基準": [
      {
        "項目": "平常点（演習，クラス参加，発表，グループ作業の成果等）",
        "割合": "10%",
        "詳細": "演習問題による小テストを行い，講義内容の理解度を確認することがある．"
      },
      {
        "項目": "期末試験",
        "割合": "90%",
        "詳細": "講義内容の理解度を記述式の課題により評価する．"
      }
    ],
    "成績評価結果": {
      "登録者数": "125",
      "A": "14.4",
      "B": "24.8",
      "C": "24.0",
      "D": "26.4",
      "F": "10.4",
      "他": "0.0",
      "評点平均値": "2.1",
      "備考": ""
    }
  },
  {
    "科目名": "情報と社会",
    "開講学期": "秋学期",
    "曜日・時限": "火曜日2講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "小野　景子",
    "到達目標": "「情報システムとは何か」の理解を深めるとともに，最新の情報技術への関心を高め，情報を収集する能力を身につける．",
    "概要": "皆さんは「『システム』とは何か？」「『情報システム』とはどの様なものか？」について，考えたことがあるだろうか？「情報システム」は，コンピュータシステムやプログラムを意味するものではない．「情報システム」をデザインすることは，ユーザインタフェースを設計することではない．「情報システム」は，本来，コンピュータやインターネットとは無関係な概念である．コンピュータとは無関係の「情報システム」も多数存在する． 本講義では，この様な観点から，「社会が求める情報システムとは，どの様なものなのか？」を理解する．具体的には，情報システムは，「社会，組織体または個人の活動を支える適切な情報を，収集し，加工し，伝達するための,人間活動を含む社会的な仕組みである．」とする．世の中の仕組みを情報システムとして捉えることの意味，　そして，情報システムを支えるシステムエンジニアとしての職業（仕事内容），更に，今日の「情報システム」の開発において不可欠である，著作権法，個人情報保護法等など，これら法律に関する初歩的知識を学ぶ．",
    "成績評価基準": [
      {
        "項目": "情報システムに関するレポート",
        "割合": "20%",
        "詳細": "6-9回目の学習内容の理解を確認するため，6-9回目は毎回授業中にレポートを提出する．"
      },
      {
        "項目": "ミニテスト（2回）",
        "割合": "80%",
        "詳細": "１回あたり，40点．"
      }
    ],
    "成績評価結果": {
      "登録者数": "34",
      "A": "11.8",
      "B": "29.4",
      "C": "14.7",
      "D": "20.6",
      "F": "23.5",
      "他": "0.0",
      "評点平均値": "1.9",
      "備考": ""
    }
  },
  {
    "科目名": "情報と職業",
    "開講学期": "春学期",
    "曜日・時限": "土曜日2講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "下坂　光",
    "到達目標": "現在の情報技術の動向を知り，そのうえで，情報に関わる職業も大きく変化していることを理解する。 高等学校の教員として必要な情報技術や情報産業に関する知識を習得する。 情報と職業に関するニュースに関心をもって触れられるようになる。",
    "概要": "AIをはじめとした情報技術の発展は，個人の情報の利活用や企業のビジネスのあり方を大きく変えている。とくに昨今の生成AIの普及は，その変化を加速させている。 この科目ではそういった新しい情報技術が，高等教育における情報科目の教育，個人のキャリア開発，企業の情報システムへの投資や人材育成に，どういった影響を及ぼすのかを解説する。加えて，ディスカッションや実習を通して，これらの変化を深く理解する。 また情報技術はエンジニアだけが用いるスキルではなく，あらゆるビジネスパーソンに必須のスキルである。そのような社会において，情報を教える教員が備えておくべく知識についても解説する。さらに教員から，情報と職業に関するニュースや情報提供も適宜行う。",
    "成績評価基準": [
      {
        "項目": "平常点（クラス参加，発表，グループワーク等）",
        "割合": "50%",
        "詳細": "クラスへの貢献，議論や発表への意欲"
      },
      {
        "項目": "期末レポート",
        "割合": "50%",
        "詳細": "授業内容の理解，自分の意見が述べられているか"
      }
    ],
    "成績評価結果": {
      "登録者数": "16",
      "A": "37.5",
      "B": "25.0",
      "C": "31.3",
      "D": "6.3",
      "F": "0.0",
      "他": "0.0",
      "評点平均値": "2.9",
      "備考": ""
    }
  },
  {
    "科目名": "情報システム実習",
    "開講学期": "秋学期",
    "曜日・時限": "木曜日5講時",
    "単位数": 1,
    "授業形態": "実習",
    "実施方法": "面接(特例)/Face-to-face(special)",
    "教授名": "川﨑　高志",
    "到達目標": "この科目の達成目標として，具体的に次のような項目をあげられる。 （１）現代社会に不可欠な情報システムの役割とその機能の実現法の基礎を修得する。 （２）メディア情報を扱う情報システムの能力とその実現法の基礎を修得する。 （３）AI（人工知能）の基礎である機械学習の基礎を修得する。 （３）人の社会活動に伴って生じる社会情報を扱う情報システムの能力とその実現法の基礎を修得する。 （４）情報システム利用者の要望をシステム開発に反映する方法論を修得する。 （５）グループワークを通してシステム開発を行う方法論を修得する。",
    "概要": "情報システムとは，企業における業務支援システムから官公庁のデータ管理システム，交通機関の制御システム，金融システム，さらには多種多様な家電システムに至る，コンピュータと利用者が協働することによって新たな価値を創造する広範な価値創造の仕組みのことである。本科目では，そうした情報システムの役割や機能，設計開発における考え方などの基礎を，実習を交えて学習する。情報システムが扱う多種多様な情報や機能に対応して，科目では，音声や映像，テキストなどのメディア情報の処理法や，AI（人工知能）の基礎である機械学習，広く社会で繰り広げられる人間の活動に伴う社会情報の処理法などを，網羅的に扱う。また，利用者が望む情報処理要件をシステムとして具体化していく過程の実習などを通して，単にコンピュータを操作する技能を身につけるのではなく，コンピュータを用いて価値を創造する情報システムという存在の本質を理解することを目指す。 企業において研究開発あるいは情報システム開発の実務経験を有する教員が，高校生などの初学者向け教育にも適した水準の実習を行う。",
    "成績評価基準": [
      {
        "項目": "実習およびレポート",
        "割合": "80%",
        "詳細": "各回ごとに課題を実施し，授業内容の理解度を確認する。なお，実習中にレポート課題が出されることがある。"
      },
      {
        "項目": "平常点",
        "割合": "20%",
        "詳細": "原則として全回出席すること。正当な理由のない遅刻あるいは欠席は減点対象とする。"
      }
    ],
    "成績評価結果": null
  },
  {
    "科目名": "情報システム工学",
    "開講学期": "秋学期",
    "曜日・時限": "金曜日1講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "小野　景子",
    "到達目標": "オブジェクト指向アプローチによるシステム開発とソフトウェアのタスク管理 についての基本的な知識を身につけることができる．",
    "概要": "情報システム化の対象となる世界を認識してユーザ要求を明確化する「要求分析」は，情報システム開発プロセスの最上流に位置づけられ，情報システム開発プロセス全体にとっても極めて重要な意味を持つ．要求分析において，主流として用いられている手法は，設計思想としては「オブジェクト指向」である．本講義では，ソフトウェアの仕組み，プロジェクトマネジメントの理解も合わせ行うことで，オブジェクト指向によるプログラミング開発の理解を深めることを目的とする．",
    "成績評価基準": [
      {
        "項目": "ミニテスト（演習）",
        "割合": "30%",
        "詳細": "毎回，演習をしてもらいます．"
      },
      {
        "項目": "演習(システム開発)",
        "割合": "35%",
        "詳細": ""
      },
      {
        "項目": "演習(クラス図)",
        "割合": "35%",
        "詳細": ""
      }
    ],
    "成績評価結果": {
      "登録者数": "84",
      "A": "7.1",
      "B": "31.0",
      "C": "25.0",
      "D": "14.3",
      "F": "22.6",
      "他": "0.0",
      "評点平均値": "1.9",
      "備考": ""
    }
  },
  {
    "科目名": "情報セキュリティ",
    "開講学期": "秋学期",
    "曜日・時限": "水曜日2講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "木村　共孝",
    "到達目標": "（知識）情報処理技術者試験である情報処理安全確保支援士合格に向けた基礎的な幅広い知識を習得できるようになる． （技能）情報セキュリティに関する一般的な問題を総合的に解決できるようになる． （態度）様々なシステムを情報セキュリティの観点から捉えることができるようになる．",
    "概要": "安全・安心な情報化社会の実現とその維持のために情報セキュリティは益々重要になってきている。本講義では，情報システムを情報セキュリティの観点から捉える方法論を学ぶことで，情報のセキュリティを確保し維持するための問題把握能力および問題解決能力の基礎を養う。",
    "成績評価基準": [
      {
        "項目": "期末試験",
        "割合": "60%",
        "詳細": "講義内容が理解できているか評価する。"
      },
      {
        "項目": "レポート",
        "割合": "40%",
        "詳細": "講義の理解度を高めるため，演習の実施とレポートの提出を行う。"
      }
    ],
    "成績評価結果": {
      "登録者数": "78",
      "A": "23.1",
      "B": "33.3",
      "C": "28.2",
      "D": "11.5",
      "F": "3.8",
      "他": "0.0",
      "評点平均値": "2.6",
      "備考": ""
    }
  },
  {
    "科目名": "情報メディア",
    "開講学期": "春学期",
    "曜日・時限": "火曜日1講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "芳賀　博英",
    "到達目標": "受講生は ・「情報」に対する認識の深化， ・「メディア」に対する認識の深化， ・「歴史」に対する認識の深化， ・さまざまな「モノ」に潜む情報メディアの認識の深化 を学び，気づくことができるようになる．また，同時に ・今ある「モノ」がなぜ今の「カタチ」になっているか，を理解する． ・答えのない問い，答えが分からない問いにどう対峙するか？ という疑問についても考えるきっかけとなる．",
    "概要": "人に情報を伝える手段・媒体を，ここでは「情報メディア」と呼びます．この講義では， ・歴史という視点からの情報（とメディア） ・情報という視点から見た歴史 について述べます． 従来「情報メディア」という言葉は，多くの場合コンピュータと結びついて使われてきましたが，考えてみればコンピュータが生まれるはるか前から「情報」は存在していたはずです．そしてその「情報」を運ぶ媒体として「情報メディア」も同じ歴史を持っているはずです．極端に言えば，生物が持っている遺伝情報を情報の嚆矢だとすると，最古の情報メディアは細胞ということになります．つまり情報メディアは生物の誕生とともに生まれてきたとも言えます．この講義では，情報をこのように捉えて，（生物の発生と細胞までは遡りませんが）情報メディアの歴史と，歴史を情報という視点から見た解釈について講義します． また，メディアの上に情報を載せるためにはさまざまな加工が必要です．この講義ではこれらの加工を総称して「編集」と呼びます．編集の仕方によって情報はさまざまに姿を変え，時には意味すらも変わってきます．この講義の後半ではこの「編集」という行為を情報の視点から読み解きます． 技術的な内容はほとんど含まれていません．プログラミングなども出てきません．むしろ世界史的な要素が多くあります．と言っても，年代を覚えたりさまざまな出来事を暗記する必要はありません．むしろ，世界史の流れを「情報」という視点から見たらどのように解釈できるか，情報の歴史的な変遷ということについて述べます．",
    "成績評価基準": [
      {
        "項目": "講義中に示した課題",
        "割合": "100%",
        "詳細": ""
      }
    ],
    "成績評価結果": {
      "登録者数": "82",
      "A": "68.3",
      "B": "17.1",
      "C": "6.1",
      "D": "6.1",
      "F": "2.4",
      "他": "0.0",
      "評点平均値": "3.4",
      "備考": ""
    }
  },
  {
    "科目名": "情報メディア実習",
    "開講学期": "春学期",
    "曜日・時限": "木曜日1講時",
    "単位数": 1,
    "授業形態": "実習",
    "実施方法": "面接/Face-to-face",
    "教授名": "藤田　倫弘",
    "到達目標": "知識：コンピュータによるマルチメディア処理の概要を理解する． 技能：一般的な文書作成ソフト・表計算ソフト・プレゼンテーションソフトを用いてマルチメディアを活用した情報表現と情報処理ができるようになる． 態度：マルチメディアを活用した情報表現の実現手段を自ら考えられるようになる．",
    "概要": "図・グラフ・写真・音などのマルチメディアを活用した情報表現，情報処理の基礎を，文書作成ソフト，表計算ソフト，プレゼンテーションソフトなどを用いて実習する． 通信会社の研究所での研究開発の経験を有する教員が，実社会でのコンピュータ利用の実態を踏まえて，実習を進める．",
    "成績評価基準": [
      {
        "項目": "実習レポート",
        "割合": "80%",
        "詳細": "各回の実習課題に対する提出資料の完成度"
      },
      {
        "項目": "平常点",
        "割合": "20%",
        "詳細": "授業参加態度"
      }
    ],
    "成績評価結果": {
      "登録者数": "102",
      "A": "38.2",
      "B": "38.2",
      "C": "11.8",
      "D": "6.9",
      "F": "4.9",
      "他": "0.0",
      "評点平均値": "3.0",
      "備考": ""
    }
  },
  {
    "科目名": "情報工学実験Ⅰ",
    "開講学期": "秋学期",
    "曜日・時限": "木曜日3講時・木曜日4講時・木曜日5講時",
    "単位数": 2,
    "授業形態": "実験",
    "実施方法": "面接/Face-to-face",
    "教授名": "奥田　正浩",
    "到達目標": "コンピュータシステムの基礎となる事項への理解を深め，計器の使用法と測定データの整理や解析方法を習得する．",
    "概要": "ネットワークや通信，ハードウエア，グラフィックス，パターン認識などの実験を行い，コンピュータシステムの基礎となる事項への理解を深める。またこれらの実験を通して，計器の使用法と測定データの整理や解析方法についても学ぶ。実験テーマは，１）計算機ハードウェア，２）CGと画像処理，３）パターン認識，４）電子メールと通信規約，５）ロボットシミュレータによる移動ロボットセンシングと制御の５つで，各人はこの中から３つのテーマを選び，それぞれ４週に渡って行う．各テーマ最終週はレポートのチェックを行う。 企業内研究所での勤務経験を有する教員が，当該研究所で習得した技術を基礎とした実験を行っている．",
    "成績評価基準": [
      {
        "項目": "実験レポート",
        "割合": "80%",
        "詳細": "各テーマ毎に提出するレポート"
      },
      {
        "項目": "平常点",
        "割合": "20%",
        "詳細": "実験参加態度"
      }
    ],
    "成績評価結果": {
      "登録者数": "97",
      "A": "16.5",
      "B": "52.6",
      "C": "25.8",
      "D": "4.1",
      "F": "1.0",
      "他": "0.0",
      "評点平均値": "2.8",
      "備考": ""
    }
  },
  {
    "科目名": "情報工学実験Ⅱ",
    "開講学期": "春学期",
    "曜日・時限": "木曜日3講時・木曜日4講時・木曜日5講時",
    "単位数": 2,
    "授業形態": "実験",
    "実施方法": "面接/Face-to-face",
    "教授名": "藤田　倫弘",
    "到達目標": "（知識） 実験テーマの領域についての基本的な知識を身につける． （技能） 実験の報告書としての実験レポートの書き方を学び，卒業論文等の学術報告の執筆のための基礎的なスキルを身につける． （態度） 情報工学の各分野について理解を深める．",
    "概要": "マルチメディア処理, CGプログラミング, 信号処理, 通信ネットワークシミュレーションなどに関する実験を行い，情報工学の各分野について理解を深める． 実験科目では，遅滞せずに実験に参加することが重要であるので，遅刻・欠席は大幅な減点の対象となる． なお，企業内研究所での勤務経験を有する教員が，当該研究所で習得した技術を基礎とした実験を行っている．",
    "成績評価基準": [
      {
        "項目": "平常点（出席，クラス参加，発表，グループ作業の成果等）",
        "割合": "20%",
        "詳細": "遅刻・欠席は大幅な減点の対象となる"
      },
      {
        "項目": "レポート",
        "割合": "80%",
        "詳細": "内容により評価する"
      },
      {
        "項目": "特記事項",
        "割合": "",
        "詳細": "各実験テーマ毎に実験レポートを課し，その内容により評価する。なお，１テーマでもレポート提出をしない場合は不合格となる"
      }
    ],
    "成績評価結果": {
      "登録者数": "85",
      "A": "18.8",
      "B": "43.5",
      "C": "25.9",
      "D": "9.4",
      "F": "2.4",
      "他": "0.0",
      "評点平均値": "2.7",
      "備考": ""
    }
  },
  {
    "科目名": "情報工学実験Ⅲ",
    "開講学期": "秋学期",
    "曜日・時限": "金曜日3講時・金曜日4講時・金曜日5講時",
    "単位数": 2,
    "授業形態": "実験",
    "実施方法": "面接/Face-to-face",
    "教授名": "小野　景子",
    "到達目標": "（知識）教師あり学習，データベース，連想と推論，デジタル通信システム，コンピュータハードウエア等それぞれの研究に特化した基礎技術を実験を通してが理解できるようになる。 （態度）実験を通して，情報システムの基礎知識を探求できるようになる。 （技能）実験を通して，情報システムを設計・開発するために必要な知識・技術を身に付けるようになる。",
    "概要": "教師あり学習，データベース，連想と推論，ディジタル通信システム，コンピュータハードウエア等に関する基礎的な事項について，計算機を使う実験を通して理解する。 ・第1回　レポートの書き方について学習する。 ・第2回　実験全体についての実施説明と，各テーマの概要説明を行う。そのときに各学生のテーマの希望を調査する。 ・第3回～ 各実験テーマごとに各班に分かれて実験を実施。　実験実施の時間枠は，3～5講時×12週である。 ・テーマは5個，各受講者はその中から3テーマを選択し，１テーマについて4週で完了するようにする。従って，実際に出席する実験は合計12週である。 ・テーマの割合は希望調査にもとづいて行うが，希望通りのテーマを完全に割当てられる保証はない。 ・各テーマの題目： 1. 教師あり学習 2. データベース 3. 連想と推論 4. ディジタル通信 5. コンピュータハードウエア",
    "成績評価基準": [
      {
        "項目": "平常点",
        "割合": "20%",
        "詳細": "出席，クラス参加，発表，グループ作業の成果等"
      },
      {
        "項目": "各テーマ毎に提出するレポートで評価する",
        "割合": "80%",
        "詳細": "提出レポートについて，文章や図解などを用いた適切な説明がレポートの各項目に応じて正しく記述されていることが必須である."
      }
    ],
    "成績評価結果": {
      "登録者数": "85",
      "A": "16.5",
      "B": "60.0",
      "C": "20.0",
      "D": "1.2",
      "F": "2.4",
      "他": "0.0",
      "評点平均値": "2.9",
      "備考": ""
    }
  },
  {
    "科目名": "情報工学応用論",
    "開講学期": "秋学期",
    "曜日・時限": "月曜日3講時",
    "単位数": 1,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "藤田　倫弘",
    "到達目標": "卒業研究を実施するにあたっての研究室の選択を行え，各研究室の研究テーマの概要を理解できるようになる。",
    "概要": "本講は，3年次の学生を対象とする。インテリジェント情報工学科内の各研究室における研究内容を中心とした情報工学の全般について学ぶ。卒業研究着手の前段階の講義となる。 なお，企業での勤務経験を有する教員が，当該企業で習得した技術を基礎とした講義を行っている。",
    "成績評価基準": [
      {
        "項目": "レポート",
        "割合": "50%",
        "詳細": "講義内容の理解度など"
      },
      {
        "項目": "平常点",
        "割合": "50%",
        "詳細": "授業の受講状況"
      }
    ],
    "成績評価結果": null
  },
  {
    "科目名": "情報工学概論Ⅰ",
    "開講学期": "春学期",
    "曜日・時限": "月曜日3講時",
    "単位数": 1,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "藤田　倫弘",
    "到達目標": "学生が，インテリジェント情報工学科が取り扱う学問領域の概要・広がりを理解し，在学中の系統的な学習計画を立てられるようになる．",
    "概要": "インテリジェント情報工学科ではどのようなことを学ぶか，各科目がどのような関係でつながっているか，インテリジェント情報工学科で学ぶことと卒業後の仕事とはどのようにつながるのか，当該科目が現時点で技術的にはどのような位置づけになっているか，などについて，各専門科目の担当教員が概説する。 なお，企業での勤務経験を有する教員が，当該企業で習得した技術を基礎とした講義を行っている。",
    "成績評価基準": [
      {
        "項目": "レポート",
        "割合": "50%",
        "詳細": "講義内容の理解度など"
      },
      {
        "項目": "平常点",
        "割合": "50%",
        "詳細": "授業の受講状況"
      }
    ],
    "成績評価結果": null
  },
  {
    "科目名": "情報工学概論Ⅱ",
    "開講学期": "秋学期",
    "曜日・時限": "水曜日5講時",
    "単位数": 1,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "藤田　倫弘",
    "到達目標": "学生が情報科学の学問分野の広がりを理解するとともに，自分が将来目指すべき領域のイメージを膨らませ，2年生以降の学習計画を立てられるようになる．",
    "概要": "インテリジェント情報工学科で学ぶ内容，およびインテリジェント情報工学科に関連する学問分野のいくつかについて，その分野にかかわる教員が詳しく説明する．",
    "成績評価基準": [
      {
        "項目": "レポート",
        "割合": "50%",
        "詳細": "講義内容の理解度など"
      },
      {
        "項目": "平常点",
        "割合": "50%",
        "詳細": "授業の受講状況"
      }
    ],
    "成績評価結果": null
  },
  {
    "科目名": "情報数学Ⅰ",
    "開講学期": "秋学期",
    "曜日・時限": "金曜日1講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "芳賀　博英",
    "到達目標": "学生は （1）高校までの直感的に導入されていた各種の概念を厳密に取り扱えるようになる． （2）離散数学の基礎的な知識を習得できるようになる （3）具体的な問題に対して，集合・論理を適用して問題解決が出来るようになる．",
    "概要": "本講義では，集合論・論理・関係・関数・数学的帰納法・無限集合についての基礎的な内容を講義します。 コンピュータは離散（ディジタル）な存在であり，そこで使われる数学は，他の工学分野で利用される数学とは若干異なっています。電気工学や機械工学などの伝統的な工学分野では微分・積分に代表される連続値を扱う数学（解析学）が主役でしたが，情報工学では集合論，論理，グラフ理論，組み合わせ数学などの，離散的な対象を扱う数学が主役となります。本講義ではこれらの離散的な素材を扱う数学（離散数学）のうち，もっとも基本となる集合論と論理，それに関係，関数などの扱いに焦点を当てます。その上で高校までの数学と大学での数学のギャップを埋めるために，前述を題材を使って「証明」ということに焦点を当てます．つまり高校までの数学と大学での数学の違いを，証明という行為を通して知ってもらいます．また「関係」という日常的に使う言葉を数学でどう扱うかということを説明し，高校までの数学でお馴染みの「関数」を関係の特殊な場合という視点で整理します．また，高校の数学までは直感的に捉えていた「無限」というものについての，数学的取り扱いについても言及します． 論理はコンピュータを動作させているもっとも根本的な原理の一つです。すべてのコンピュータは究極的には論理演算を実行するマシンであり，情報工学において論理学に習熟することは，ハードウエア，ソフトウエアの両面で極めて重要です。本講義では論理学のうちで，基礎的な命題論理と述語論理そして証明法について述べます。集合と論理，特に述語論理は密接に関係していますので，その関連についても述べます． その後に，集合論と論理を基礎において，関係・関数・数学的帰納法などを講義し，最後に大学の数学と高校までの数学との大きな違いである無限の取り扱いについて述べます．",
    "成績評価基準": [
      {
        "項目": "中間評価",
        "割合": "50%",
        "詳細": "中間評価実施の週の前の週までの講義内容が理解できているかどうか"
      },
      {
        "項目": "期末試験",
        "割合": "50%",
        "詳細": "講義全体が理解できているかどうか（中間評価の範囲も含みます）"
      }
    ],
    "成績評価結果": {
      "登録者数": "90",
      "A": "1.1",
      "B": "7.8",
      "C": "16.7",
      "D": "25.6",
      "F": "48.9",
      "他": "0.0",
      "評点平均値": "0.9",
      "備考": ""
    }
  },
  {
    "科目名": "情報数学Ⅱ",
    "開講学期": "春学期",
    "曜日・時限": "木曜日3講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "齋藤　誠慈",
    "到達目標": "離散数学である命題，論理，代数系，ブール代数，グラフ理論等の基礎的な内容を中心として取り上げ，それら分野の基礎的知識を習得し，また基礎的問題が解けるようになる．",
    "概要": "工学分野では，連続的に変化するものを対象として取り扱うことが多くあるが，ここでは，有限個でバラバラな（離散な）ものを対象として取り扱う．情報科学で現れる数学は，「離散数学」と呼ばれるものを基礎としている．この講義では，特に命題論理，代数系，ブール代数，グラフ理論等を解説する．",
    "成績評価基準": [
      {
        "項目": "課題",
        "割合": "15%",
        "詳細": "情報基礎に関する計算力と理解度，グラフに関する計算力と理解度を問う．"
      },
      {
        "項目": "試験",
        "割合": "85%",
        "詳細": "情報数学全般に関する理解度を問う．"
      }
    ],
    "成績評価結果": {
      "登録者数": "52",
      "A": "3.8",
      "B": "7.7",
      "C": "26.9",
      "D": "51.9",
      "F": "9.6",
      "他": "0.0",
      "評点平均値": "1.4",
      "備考": ""
    }
  },
  {
    "科目名": "情報理論",
    "開講学期": "秋学期",
    "曜日・時限": "月曜日1講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "程　俊",
    "到達目標": "情報をより速く，より正確に伝送する問題を解く出発点は「情報」と「それを運ぶもの」とを区別することである。この立場に立って，情報を担っている通報をそれが持っている情報を失わないように圧縮する「情報源符号化問題」と誤りの起こりうる通信路による情報伝送の誤りを抑制する「通信路符号化問題」を理解することがこの科目の目標である。",
    "概要": "情報理論は，誤りの起りうる通信環境のもとで，情報をより速く，より正確に伝送する方法を解明する理論である。情報源から出力される通報を，それが持つ情報を失わないように圧縮する「情報源符号化問題」と雑音の妨害を受けている通信路による情報伝送において伝送誤りを抑制する「通信路符号化問題」の二つが情報理論の課題である。これらの問題は情報の量的表示である「情報量」を基にして論じられる。通信路符号の構成問題は，「符号理論」で詳細に論ずる。 民間の研究機関および企業内研究所での勤務経験を有する教員が，実務で習得した技術を基礎とした講義を行っている． キーワード：情報源符号化，Shannonエントロピーの操作論的・直感的意味付け，情報の量的表示，通信路符号化",
    "成績評価基準": [
      {
        "項目": "期末筆記試験",
        "割合": "80%",
        "詳細": "情報の量的表示，情報源符号化の方法とその限界に関する理解度を確かめる．"
      },
      {
        "項目": "小レポート，演習など",
        "割合": "20%",
        "詳細": "講義内容が理解できているか評価する"
      }
    ],
    "成績評価結果": {
      "登録者数": "144",
      "A": "54.2",
      "B": "25.7",
      "C": "10.4",
      "D": "5.6",
      "F": "4.2",
      "他": "0.0",
      "評点平均値": "3.2",
      "備考": ""
    }
  },
  {
    "科目名": "情報通信ネットワーク実習",
    "開講学期": "秋学期",
    "曜日・時限": "水曜日1講時",
    "単位数": 1,
    "授業形態": "実習",
    "実施方法": "面接/Face-to-face",
    "教授名": "木村　共孝",
    "到達目標": "（知識） 情報通信ネットワーク内のパケットの流れを理解できるようになる． （技能） パケットキャプチャソフトを用いて基礎的なパケットの分析ができるようになる． （態度） 情報通信ネットワークを使う上で必要な知識・技術を身に付けるようになる．",
    "概要": "情報通信ネットワークにおける通信の仕組みをパケットキャプチャソフトを用いた実習を通して習得する．",
    "成績評価基準": [
      {
        "項目": "平常点（出席，クラス参加，発表，グループ作業の成果等）",
        "割合": "20%",
        "詳細": "出席および講義内での議論への参加を評価する．"
      },
      {
        "項目": "小レポート，実習課題の提出",
        "割合": "80%",
        "詳細": "講義内容の理解度を評価する．"
      }
    ],
    "成績評価結果": {
      "登録者数": "16",
      "A": "56.3",
      "B": "25.0",
      "C": "12.5",
      "D": "6.3",
      "F": "0.0",
      "他": "0.0",
      "評点平均値": "3.3",
      "備考": ""
    }
  },
  {
    "科目名": "技術英語Ⅰ",
    "開講学期": "春学期",
    "曜日・時限": "木曜日2講時",
    "単位数": 1,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "IVAN TANEV",
    "到達目標": "The learning objectives of the course are: (ⅰ) to ensure that students develop skills required to read， comprehend， write， publish and orally present technical papers and reports， and (ⅱ) to guarantee that students acquire the knowledge of style， vocabulary， grammar and structure of the technical language with corresponding skills needed to properly express themselves in order to manage effective international technical communications.",
    "概要": "This language-learning course is designed for non-native English speaking technology professionals. The course highlights the most important aspects of comprehending and writing technical articles and managing efficient professional communication. Providing environment for students to read， write， hear and speak technical English， the course emphasizes the vocabulary， grammar and the writing style employed in the world of modern information science and technology. Teachers who have experience in teaching Technical English at colleges and companies are teaching Technical English making use of their experiences.",
    "成績評価基準": [
      {
        "項目": "Midterm evaluation",
        "割合": "50%",
        "詳細": ""
      },
      {
        "項目": "End-term report",
        "割合": "50%",
        "詳細": ""
      }
    ],
    "成績評価結果": null
  },
  {
    "科目名": "数値解析",
    "開講学期": "秋学期",
    "曜日・時限": "水曜日1講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "土屋　隆生",
    "到達目標": "（1）計算機における誤差要因を理解できるようになる。 （2）数値微分・数値積分の手法を理解できるようになる。 （3）各種補間法について理解できるようになる。 （4）連立方程式，微分方程式の数値解法を理解できるようになる。 （5）簡単な物理現象の数値解析プログラムを作成できるようになる。",
    "概要": "マルチメディアなどで現象をリアルに表現するには，数値解析を基にしたシミュレーションの技術が欠かせない。数値シミュレーションは，複雑な現象や実現が難しい極限状態であっても解析・ビジュアル化できるため，理論，実験につぐ第3の表現手法としてもその重要性を増している。本講義では，現象をコンピュータ上で表現するためのモデル化，およびそれを数値的に解くための計算アルゴリズムの基礎を学ぶ。数値シミュレーションに必要な数値解析法からはじめ，簡単な物理現象を差分法などの数値的手法を用いてシミュレーションする方法を解説する。履修にあたり，解析学や行列の知識を習得していることが望ましい。",
    "成績評価基準": [
      {
        "項目": "平常点（クラス参加，発表，グループ作業の成果等）",
        "割合": "10%",
        "詳細": "講義の理解度を高めるために演習の実施とレポートの提出を行うことがある（複数回）。解説は次の授業の冒頭で行う。"
      },
      {
        "項目": "中間評価",
        "割合": "45%",
        "詳細": "数値解析の理解を総合的に評価する。解説は次の授業の冒頭で行う。"
      },
      {
        "項目": "期末レポート試験",
        "割合": "45%",
        "詳細": "数値解析の理解を総合的に評価する。"
      }
    ],
    "成績評価結果": {
      "登録者数": "127",
      "A": "8.7",
      "B": "28.3",
      "C": "26.8",
      "D": "23.6",
      "F": "12.6",
      "他": "0.0",
      "評点平均値": "2.0",
      "備考": ""
    }
  },
  {
    "科目名": "数値計算法",
    "開講学期": "春学期",
    "曜日・時限": "水曜日1講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "奥田　正浩",
    "到達目標": "様々な数値計算アルゴリズムを理解し，実装することができるようになる．",
    "概要": "本講義では，非線形方程式や常微分方程式など，厳密解を求めるのが困難，または可能ではあるが計算に膨大な時間を要する問題に対して，近似解が容易に得られる数値計算法を学ぶ．実際にプログラミング演習をこなすことで，実践的な知識と技能を身につける．プログラミング言語は制御，信号処理，通信などの多くの分野において研究，開発．教育に用いられているMATLABを用いる．本科目は基礎的な数学的知識，特に線形代数，微分積分を理解しているものとして講義を進める．尚，講義の進捗状況により，シラバス通りには進まない場合があるので了解されたい．",
    "成績評価基準": [
      {
        "項目": "小演習",
        "割合": "30%",
        "詳細": "各回の演習の評価"
      },
      {
        "項目": "中間演習",
        "割合": "20%",
        "詳細": "中間演習．アルゴリズムが実装できているかどうかを評価する．"
      },
      {
        "項目": "総合演習",
        "割合": "50%",
        "詳細": "期末演習．レポートとプログラム提出による評価．アルゴリズムに関する理解度を評価する．"
      }
    ],
    "成績評価結果": {
      "登録者数": "89",
      "A": "39.3",
      "B": "20.2",
      "C": "21.3",
      "D": "12.4",
      "F": "6.7",
      "他": "0.0",
      "評点平均値": "2.7",
      "備考": ""
    }
  },
  {
    "科目名": "数理統計学",
    "開講学期": "春学期",
    "曜日・時限": "火曜日2講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "桂井　麻里衣",
    "到達目標": "知識・技能：講義と毎回の演習を通して統計学の基礎概念・基本的事項について理解し，データ分析のための初歩的なプログラミングができるようになる． 思考力・判断力・表現力：データを整理したり，身近な現象と確率・確率分布の関係が理解できるようになる． 主体性・多様性・協働性：発展的な内容について自ら調査し理解できるようになる．",
    "概要": "統計学の基礎概念と基本的事項，応用例について学ぶ．",
    "成績評価基準": [
      {
        "項目": "小レポート",
        "割合": "50%",
        "詳細": "毎回の講義内容に関する理解度を評価する．"
      },
      {
        "項目": "期末試験",
        "割合": "50%",
        "詳細": "講義内容に関する総合的な理解度を評価する．"
      }
    ],
    "成績評価結果": {
      "登録者数": "105",
      "A": "16.2",
      "B": "20.0",
      "C": "34.3",
      "D": "19.0",
      "F": "10.5",
      "他": "0.0",
      "評点平均値": "2.1",
      "備考": ""
    }
  },
  {
    "科目名": "機械学習",
    "開講学期": "春学期",
    "曜日・時限": "月曜日2講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "桂井　麻里衣",
    "到達目標": "知識・技能：目的にあわせて数式の導出・変形ができるようになる． 思考力・判断力・表現力：与えられたデータに対し，適切に機械学習を応用できるようになる． 主体性・多様性・協働性：データへの適用結果を確認し，理論やアルゴリズムの理解を深められるようになる。",
    "概要": "数理統計学の知識をベースに，教師あり学習と教師なし学習の基礎的な概念を学ぶ。",
    "成績評価基準": [
      {
        "項目": "小レポート",
        "割合": "40%",
        "詳細": "講義内容に関する理解度を評価する．"
      },
      {
        "項目": "期末試験",
        "割合": "60%",
        "詳細": "講義内容に関する総合的な理解度を評価する．"
      }
    ],
    "成績評価結果": {
      "登録者数": "84",
      "A": "8.3",
      "B": "16.7",
      "C": "14.3",
      "D": "34.5",
      "F": "26.2",
      "他": "0.0",
      "評点平均値": "1.5",
      "備考": ""
    }
  },
  {
    "科目名": "特別演習実習",
    "開講学期": "秋集中",
    "曜日・時限": null,
    "単位数": 2,
    "授業形態": "演習",
    "実施方法": null,
    "教授名": "奥田　正浩",
    "到達目標": null,
    "概要": "原則的に博士課程前期課程へ飛び入学を希望する者のために用意した科目。 各研究室の教員の指導により研究室内容に応じたテーマで研究・演習を行う。 テーマは選択になるので担当教員（3人）は未定。",
    "成績評価基準": [
      {
        "項目": "研究・演習発表",
        "割合": "50%",
        "詳細": "研究・演習内容の理解度等"
      },
      {
        "項目": "研究・演習レポート",
        "割合": "50%",
        "詳細": "研究・演習内容の理解度等"
      }
    ],
    "成績評価結果": null
  },
  {
    "科目名": "特別講義Ｂ",
    "開講学期": "秋学期",
    "曜日・時限": "火曜日3講時・火曜日4講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "落合　翼",
    "到達目標": "情報工学の適用範囲の広さを認識するとともに，先端分野の知見を得る。",
    "概要": "様々な分野の研究者，専門家が最新の技術や話題について講義する。尚，本講義では，１日に２コマずつ計８回で講義を終了するので，時間割の設定では注意してください。 企業等に勤務する講師が，当該企業等で習得した技術を基礎とした講義を行っている。",
    "成績評価基準": [
      {
        "項目": "出席",
        "割合": "50%",
        "詳細": "各講義への参加状況"
      },
      {
        "項目": "レポート",
        "割合": "50%",
        "詳細": "各テーマ毎の理解度"
      }
    ],
    "成績評価結果": null
  },
  {
    "科目名": "画像処理",
    "開講学期": "春学期",
    "曜日・時限": "木曜日2講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "渡部　広一",
    "到達目標": "基礎的な各種画像処理手法を理解し，C言語による画像処理プログラムを読んで理解し，拡張できるようになる。",
    "概要": "画像処理は，与えられた画像データから有用な情報を抽出するための理論および技術である。本講義の目標は，基礎的な画像処理理論・技術を理解することである。また，画像をコンピュータで扱う際のプログラミングについても対象とし，コンピュータを用いて Ｃ言語 による画像処理プログラミングの実習を行う。したがって，C言語については理解していることを前提とする。",
    "成績評価基準": [
      {
        "項目": "実習レポート",
        "割合": "60%",
        "詳細": "各回の講義内容の理解度を見る。相談可。"
      },
      {
        "項目": "小テスト",
        "割合": "40%",
        "詳細": "講義内容全体の理解度を見る。相談不可。"
      }
    ],
    "成績評価結果": {
      "登録者数": "138",
      "A": "33.3",
      "B": "39.9",
      "C": "15.2",
      "D": "8.0",
      "F": "3.6",
      "他": "0.0",
      "評点平均値": "2.9",
      "備考": ""
    }
  },
  {
    "科目名": "知的財産権",
    "開講学期": "秋学期",
    "曜日・時限": "木曜日5講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "熊野　剛",
    "到達目標": "知的財産権に関する基礎知識を習得し，知的財産権の特徴を把握した上で，ビジネスの種々の場面で知的財産を戦略的に活用するための対応を見いだせるようになることを目標とする。",
    "概要": "主に理工学部の学生が，将来，製品製造企業やソフトウエア開発企業等における研究者・技術者等として活躍する際，あるいはこれらの企業を起業する際に，最低限知っておくべき知的財産権の基礎知識を学習する。具体的には，知的財産権をビジネスに活用するために，特許権，著作権，意匠権，商標権等の出願，権利化，活用，訴訟対応等についての知識を習得し，技術経営や知的財産戦略を考える上での基盤を提供する。 【受講条件】 受講に必要な知識等は特にない。ただし最終回授業は学内LANから学外WEB閲覧を行うので，当該授業までにネットワーク利用資格認定試験に合格しておくこと。 現役の弁理士である教員が，実務を通じた講義を行っている．",
    "成績評価基準": [
      {
        "項目": "中間評価",
        "割合": "40%",
        "詳細": "【択一評価】　第7回講義日に於いて，前半に講義をする特許法等について，研究者，技術者が知っておくべき基本知識を，択一形式で出題する。"
      },
      {
        "項目": "期末試験",
        "割合": "40%",
        "詳細": "【択一評価】　後半の講義（著作権法，意匠法，商標法，不正競争防止法，条約，知財マネジメント，特許サーチ等）について，研究者，技術者が知っておくべき基本知識を，択一形式で出題する。"
      },
      {
        "項目": "期末試験",
        "割合": "20%",
        "詳細": "【論文評価】　全講義の中から重要な事項について問う問題１問もしくは２問を論文形式で出題する。"
      },
      {
        "項目": "特記事項",
        "割合": "",
        "詳細": "成績評価基準は，中間評価および期末試験の点数合計が60%以上を合格とする。"
      }
    ],
    "成績評価結果": {
      "登録者数": "146",
      "A": "8.2",
      "B": "22.6",
      "C": "47.3",
      "D": "15.8",
      "F": "6.2",
      "他": "0.0",
      "評点平均値": "2.1",
      "備考": ""
    }
  },
  {
    "科目名": "知識情報処理",
    "開講学期": "秋学期",
    "曜日・時限": "金曜日2講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "土屋　誠司",
    "到達目標": "（知識）人工知能を代表とする知識情報処理に不可欠な要素技術とその応用技術を習得できるようになる． （技能）知識情報処理に関する新しい技術を自ら創出できるようになる． （態度）様々なシステムを知識情報処理の観点から捉えることができるようになる．",
    "概要": "情報化社会の発展の中で，人間のような柔軟な判断能力を備え，人に優しいインタフェースを持つ計算機システムの出現が期待されている。本講義では，知的な情報処理を実現するために重要な要素技術について横断的に学ぶ。従来，個別に扱われてきた知的化要素技術に関して知識情報処理としての枠組みで統合的に理解を深める。 なお，企業内研究所での勤務経験を有する教員が，当該研究所で習得した技術を基礎とした講義を行っている．",
    "成績評価基準": [
      {
        "項目": "提出物（ノート，レポートなど）",
        "割合": "90%",
        "詳細": "講義内容が理解できているか評価する"
      },
      {
        "項目": "その他",
        "割合": "10%",
        "詳細": "出席状況などを評価する"
      }
    ],
    "成績評価結果": {
      "登録者数": "87",
      "A": "19.5",
      "B": "23.0",
      "C": "24.1",
      "D": "27.6",
      "F": "5.7",
      "他": "0.0",
      "評点平均値": "2.2",
      "備考": ""
    }
  },
  {
    "科目名": "符号理論",
    "開講学期": "春学期",
    "曜日・時限": "火曜日2講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "程　俊",
    "到達目標": "（知識）雑音の影響を受ける通信路を通して，情報をより正しく，より速く伝達する仕組みを理解できるようになる。 （態度）数学のわかりやすい表現力を実践で習得できるようになる。 （技能）代数学の記述を通じて，符号理論の体系を学習することで，情報伝達理論と技術を身につけることができるようになる。",
    "概要": "情報を符号化して通信路を通して伝えるとき，伝送の効率化及び信頼性向上を図るための符号理論を学習する。通信の信頼性と通信路の効率的利用の関係を示すシャノンの通信路符号化定理を理解し，誤り検出符号と誤り訂正符号の構成理論を学習する。 民間の研究機関および企業内研究所での勤務経験を有する教員が，実務で習得した技術を基礎とした講義を行っている。",
    "成績評価基準": [
      {
        "項目": "期末試験",
        "割合": "80%",
        "詳細": "通信路符号の要点を理解するとともに，符号の構成，符号化，復号化が行えること。"
      },
      {
        "項目": "小レポート，演習など",
        "割合": "20%",
        "詳細": "講義時間内で適宜実施する。出席，積極的な授業への参加"
      }
    ],
    "成績評価結果": {
      "登録者数": "80",
      "A": "20.0",
      "B": "23.8",
      "C": "16.3",
      "D": "17.5",
      "F": "22.5",
      "他": "0.0",
      "評点平均値": "2.0",
      "備考": ""
    }
  },
  {
    "科目名": "線形代数学Ⅰ",
    "開講学期": "春学期",
    "曜日・時限": "水曜日5講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "萬代　武史",
    "到達目標": "ベクトルの演算，行列の演算と基本変形，連立1次方程式の解法，行列の階数，逆行列の計算などができるようになる．",
    "概要": "線形代数学Ⅰ・Ⅱにおいては，種々のシステム解析などを行う際に重要な役割を果たす線形理論の基礎と応用を解説する。表現形式としてはベクトルと行列の基本理論と言ってもよい．特に線形代数学Ⅰでは，ベクトルの演算や行列の演算・基本変形，行列の階数，行列式などを理解し，連立１次方程式を行列を使って解くことができることを目標とする．",
    "成績評価基準": [
      {
        "項目": "課題など",
        "割合": "15%",
        "詳細": "授業内容を理解しているか確認する．"
      },
      {
        "項目": "小テスト",
        "割合": "35%",
        "詳細": "授業内容の理解度をみる．採点結果は返却し，解説を行う．"
      },
      {
        "項目": "期末試験",
        "割合": "50%",
        "詳細": "授業全体の授業内容の理解度を見る．解説は第15週の授業において行う．"
      }
    ],
    "成績評価結果": {
      "登録者数": "87",
      "A": "40.2",
      "B": "41.4",
      "C": "12.6",
      "D": "2.3",
      "F": "3.4",
      "他": "0.0",
      "評点平均値": "3.1",
      "備考": ""
    }
  },
  {
    "科目名": "線形代数学Ⅱ",
    "開講学期": "秋学期",
    "曜日・時限": "水曜日4講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "萬代　武史",
    "到達目標": "行列の固有値とその固有ベクトルを理解し，行列の対角化の計算ができるようになる．また，部分空間の基底と次元，高次元ベクトルの内積に関して正しく理解する．",
    "概要": "線形代数学I,Ⅱにおいては，種々のシステム解析などを行う際に重要な役割を果たす線形理論の基礎と応用を解説する．表現形式としてはベクトルと行列の基本理論と言ってもよい．特に線形代数学IIでは，線形代数学Ⅰの内容をふまえながら，部分空間の基底と次元や行列の固有値とその固有ベクトルについて理解し，行列の対角化の計算ができることを目標とする．また，高次元ベクトルの内積に関する事項も学ぶ．",
    "成績評価基準": [
      {
        "項目": "課題など",
        "割合": "15%",
        "詳細": "授業内容を理解しているか確認する"
      },
      {
        "項目": "小テスト",
        "割合": "35%",
        "詳細": "授業内容の理解度をみる．採点結果は返却し，解説を行う．"
      },
      {
        "項目": "期末試験",
        "割合": "50%",
        "詳細": "授業全体の授業内容の理解度を見る．解説は第15 週の授業において行う．"
      }
    ],
    "成績評価結果": {
      "登録者数": "83",
      "A": "26.5",
      "B": "30.1",
      "C": "26.5",
      "D": "12.0",
      "F": "4.8",
      "他": "0.0",
      "評点平均値": "2.6",
      "備考": ""
    }
  },
  {
    "科目名": "自然言語処理",
    "開講学期": "春学期",
    "曜日・時限": "水曜日3講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "土屋　誠司",
    "到達目標": "（知識）自然言語処理に不可欠な要素技術とその応用技術を習得できるようになる． （技能）自然言語処理に関する新しい技術を自ら創出できるようになる． （態度）様々なシステムを自然言語処理の観点から捉えることができるようになる．",
    "概要": "情報化社会の発展の中で，人間のような柔軟な判断能力を備え，人に優しいインタフェースを持つ計算機システムの出現が期待されている．本講義では，人にとって最も自然で効率的な自然言語によるコミュニケーションを計算機システムで実現するために重要な要素技術について学ぶ．計算機システムから見た場合の自然言語の特徴と自然言語を計算機システムで取り扱う技術である自然言語処理技術について理解する． なお，企業内研究所での勤務経験を有する教員が，当該研究所で習得した技術を基礎とした講義を行っている．",
    "成績評価基準": [
      {
        "項目": "提出物（ノート，レポートなど）",
        "割合": "90%",
        "詳細": "講義内容が理解できているか評価する"
      },
      {
        "項目": "その他",
        "割合": "10%",
        "詳細": "受講状況などを評価する"
      }
    ],
    "成績評価結果": {
      "登録者数": "86",
      "A": "15.1",
      "B": "32.6",
      "C": "36.0",
      "D": "9.3",
      "F": "7.0",
      "他": "0.0",
      "評点平均値": "2.4",
      "備考": ""
    }
  },
  {
    "科目名": "複素解析",
    "開講学期": "春学期",
    "曜日・時限": "金曜日2講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "齋藤　誠慈",
    "到達目標": "複素関数の微分と積分に関連した用語と定理を理解し，それらを応用した計算技術を習得できる．",
    "概要": "工科の数学に現れる多くの関数は解析関数であって，独立変数が複素数値をとる場合のふるまいを調べれば，それらの性質をより深く理解することができる．さらに複素積分は，実用的に興味ある複雑な複素積分や実積分を計算するのに役に立つ．",
    "成績評価基準": [
      {
        "項目": "試験",
        "割合": "85%",
        "詳細": "計算力と応用力を問う"
      },
      {
        "項目": "課題",
        "割合": "15%",
        "詳細": "解説を聞いて計算方法を理解しているか確認する"
      }
    ],
    "成績評価結果": {
      "登録者数": "32",
      "A": "12.5",
      "B": "9.4",
      "C": "28.1",
      "D": "37.5",
      "F": "12.5",
      "他": "0.0",
      "評点平均値": "1.7",
      "備考": ""
    }
  },
  {
    "科目名": "解析学Ⅰ",
    "開講学期": "春学期",
    "曜日・時限": "火曜日2講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "島田　伸一",
    "到達目標": "多項式，指数・対数関数，三角関数など初等関数を理解し，その収束，微分，不定積分，定積分の基本的計算でき，数列などの収束の概念を学び，基礎的計算ができるようになる．",
    "概要": "解析学Ⅰにおいては，種々のシステム解析する際に重要な1変数の微分積分学に関する基礎を解説する．特に，実数とその演算や関数の概念，微分，積分，数列を理解し，数列の極限や収束の計算できることを目標とする．",
    "成績評価基準": [
      {
        "項目": "演習・小テスト",
        "割合": "30%",
        "詳細": "主に計算方法を理解しているか確認する"
      },
      {
        "項目": "筆記期末試験",
        "割合": "70%",
        "詳細": "概念や計算方法の理解度を測る"
      }
    ],
    "成績評価結果": {
      "登録者数": "79",
      "A": "63.3",
      "B": "17.7",
      "C": "10.1",
      "D": "6.3",
      "F": "2.5",
      "他": "0.0",
      "評点平均値": "3.3",
      "備考": ""
    }
  },
  {
    "科目名": "解析学Ⅱ",
    "開講学期": "秋学期",
    "曜日・時限": "火曜日3講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "島田　伸一",
    "到達目標": "多変数関数の微分と積分に関連した用語と定理を理解し，それらを応用した計算技術が習得できる．",
    "概要": "解析学Ⅰで学んだことを基礎とし，主として多変数の微積分について理解を深めることを目的とする．多変数関数の偏微分，重積分などについて学ぶ．",
    "成績評価基準": [
      {
        "項目": "演習・小テスト",
        "割合": "30%",
        "詳細": "主に計算方法を理解しているか確認する."
      },
      {
        "項目": "期末試験",
        "割合": "70%",
        "詳細": "講義内容全体の理解度をみる."
      }
    ],
    "成績評価結果": {
      "登録者数": "83",
      "A": "37.3",
      "B": "27.7",
      "C": "14.5",
      "D": "12.0",
      "F": "8.4",
      "他": "0.0",
      "評点平均値": "2.7",
      "備考": ""
    }
  },
  {
    "科目名": "言語理論",
    "開講学期": "秋学期",
    "曜日・時限": "水曜日2講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "芳賀　博英",
    "到達目標": "学生は (1) オートマトンと正規表現の概念が理解でき，具体的な問題に応用できるようになる． (2) 文脈自由言語の解析法の基礎的な技法を身につけ，基本的な構文解析系のプログラムが書けるようになる．",
    "概要": "この講義では，オートマトン・正規表現・形式文法について，その基礎的な内容を講義します，実用上最も重要な文脈自由文法について，その概念を述べた後，その解析法について述べます．",
    "成績評価基準": [
      {
        "項目": "中間評価",
        "割合": "50%",
        "詳細": "オートマトン，正規表現の基礎的な事項の理解度"
      },
      {
        "項目": "期末試験",
        "割合": "50%",
        "詳細": "文法の概念と構文解析法の手法の理解度"
      }
    ],
    "成績評価結果": {
      "登録者数": "101",
      "A": "12.9",
      "B": "30.7",
      "C": "25.7",
      "D": "14.9",
      "F": "15.8",
      "他": "0.0",
      "評点平均値": "2.1",
      "備考": ""
    }
  },
  {
    "科目名": "計算機アーキテクチャ",
    "開講学期": "春学期",
    "曜日・時限": "金曜日2講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "奥田　正浩",
    "到達目標": "計算機アーキテクチャの基本的な知識を身につけることができる．",
    "概要": "「計算機ハードウェア」の講義内容を前提として，計算機アーキテクチャの基本的な知識を身につけることを目的とする．講義の前半では，数値表現についての知識を深めた後，計算機アーキテクチャとアセンブラについて解説する．",
    "成績評価基準": [
      {
        "項目": "小テスト",
        "割合": "40%",
        "詳細": "小テストを2回行います"
      },
      {
        "項目": "期末試験",
        "割合": "60%",
        "詳細": "全講義範囲から出題します．"
      }
    ],
    "成績評価結果": {
      "登録者数": "63",
      "A": "15.9",
      "B": "25.4",
      "C": "19.0",
      "D": "20.6",
      "F": "19.0",
      "他": "0.0",
      "評点平均値": "2.0",
      "備考": ""
    }
  },
  {
    "科目名": "計算機ハードウェア",
    "開講学期": "秋学期",
    "曜日・時限": "木曜日2講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "奥田　正浩",
    "到達目標": "計算機の中で何が起こっているかを頭の中でイメージしてシミュレーションできる．",
    "概要": "本講義では，コンピュータを構成する各ハードウェア構成要素とその役割について，部品・装置の視点から理解を深める．このため，トランジスタ・電気回路への初歩的な理解を要求される（必要な知識は講義で紹介する）．最終的に，受講生は，計算機の中で何が起こっているかを頭の中でイメージしてシミュレーションできるようになってほしい．このため，本科目では，基本的な物理学の知識と，情報数学の基礎は前提とする．",
    "成績評価基準": [
      {
        "項目": "小テスト",
        "割合": "40%",
        "詳細": "授業時間中に2回のミニテストを予定しています．"
      },
      {
        "項目": "期末筆記レポート試験",
        "割合": "60%",
        "詳細": "全講義内容から出題します．"
      }
    ],
    "成績評価結果": {
      "登録者数": "103",
      "A": "20.4",
      "B": "28.2",
      "C": "36.9",
      "D": "5.8",
      "F": "8.7",
      "他": "0.0",
      "評点平均値": "2.5",
      "備考": ""
    }
  },
  {
    "科目名": "通信ネットワーク",
    "開講学期": "春学期",
    "曜日・時限": "水曜日1講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "木村　共孝",
    "到達目標": "（知識）WWWや電子メールなどを具体例として，インターネットを支える技術を学習し，通信ネットワークの仕組みを理解できるようになる． （態度）通信ネットワークに興味を持ち，その開発に必要な知識・技術を探求できるようになる． （技能）通信ネットワークの開発するために必要な知識・技術を身に付けるようになる．",
    "概要": "通信ネットワークは，社会インフラとしてのネットワークやコミュニケーション環境に多大な変化をもたらしている．本講義では，最も身近なインターネットに焦点を当て，インターネットがどのような仕組みで働き，どのように運用されているか，また，インターネットを支える技術がどのようになっているかについて学習する．このように，通信ネットワークにかかわる技術の学習を通じて，情報通信の重要性と役割について理解することが，本講義の目的である．",
    "成績評価基準": [
      {
        "項目": "レポート",
        "割合": "30%",
        "詳細": "授業内容の理解度"
      },
      {
        "項目": "期末試験",
        "割合": "70%",
        "詳細": "授業で学習する内容全般についての理解度を確認する"
      }
    ],
    "成績評価結果": {
      "登録者数": "105",
      "A": "13.3",
      "B": "18.1",
      "C": "31.4",
      "D": "29.5",
      "F": "7.6",
      "他": "0.0",
      "評点平均値": "2.0",
      "備考": ""
    }
  },
  {
    "科目名": "運動学の基礎",
    "開講学期": "秋学期",
    "曜日・時限": "水曜日2講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "橋本　雅文",
    "到達目標": "（1）物体の運動を数式を用いて表現，取り扱うことができるようになる． （2）物体運動と微分方程式の関係を理解し，簡単な方程式を解くことができるようになる． （3）力学の基礎が理解できるようになる．",
    "概要": "情報通信技術，電子技術，機械技術を融合したメカトロニクスシステムやロボットでは，センシング制御対象の運動を解析することが不可欠である。本講義は今後のメカトロニクスシステム，ロボット関連の学習に必要な物体運動の記述法や解析法に関する基礎知識を付与することを目的とする。ベクトル解析や微積分などの数学の知識を解説しながら，物体の運動学（位置，速度，加速度の関係），質点や剛体の力学の基礎を修得する。そして，工学における物理現象に対する数学表現の重要性を学ぶ。",
    "成績評価基準": [
      {
        "項目": "平常点（クラス参加，発表，グループ作業の成果等）",
        "割合": "10%",
        "詳細": "毎回，小テストを行い，出欠とともに講義内容の理解度を確認する。なお，大幅な遅刻は欠席とみなす。"
      },
      {
        "項目": "レポート課題",
        "割合": "5%",
        "詳細": "複数回のレポートを課し，講義内容の理解度を評価する。レポートの解説は授業で行う。"
      },
      {
        "項目": "期末試験",
        "割合": "85%",
        "詳細": "講義内容の理解度と論理的思考力を評価する。期末試験の解説は授業講評で行う。"
      }
    ],
    "成績評価結果": {
      "登録者数": "87",
      "A": "13.8",
      "B": "29.9",
      "C": "17.2",
      "D": "14.9",
      "F": "24.1",
      "他": "0.0",
      "評点平均値": "1.9",
      "備考": ""
    }
  },
  {
    "科目名": "電気の基礎",
    "開講学期": "春学期",
    "曜日・時限": "水曜日2講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "土屋　隆生",
    "到達目標": "（1）直流回路の計算ができるようになる。 （2）交流回路の計算ができるようになる。 （3）簡単な電気回路の動作を説明できるようになる。",
    "概要": "ITは最先端の電子技術を常に取り込むことで発展し続けており，IT技術者もこれに対応する必要がある。そのためには，電気・電子に関する基礎知識の修得がIT技術者にも要求される。本講義では，IT技術者として最低限必要な電気・電子回路学の基礎を修得することを目的とする。履修にあたり，物理系の科目を履修していることや，複素数の知識を習得していることが望ましい。",
    "成績評価基準": [
      {
        "項目": "平常点（クラス参加，発表，グループ作業の成果等）",
        "割合": "10%",
        "詳細": "講義の理解度を高めるために演習の実施とレポートの提出を行うことがある（複数回）。解説は次の授業の冒頭で行う。"
      },
      {
        "項目": "中間試験",
        "割合": "45%",
        "詳細": "電気回路の基礎が理解できているか評価する。解説は次の授業の冒頭で行う。"
      },
      {
        "項目": "期末試験",
        "割合": "45%",
        "詳細": "電気・電子回路の理解度を総合的に評価する。"
      },
      {
        "項目": "特記事項",
        "割合": "",
        "詳細": "点数配分は目安であり，評価項目の難易度に応じて変更する場合がある。"
      }
    ],
    "成績評価結果": {
      "登録者数": "112",
      "A": "7.1",
      "B": "18.8",
      "C": "18.8",
      "D": "21.4",
      "F": "33.9",
      "他": "0.0",
      "評点平均値": "1.4",
      "備考": ""
    }
  },
  {
    "科目名": "音声処理",
    "開講学期": "秋学期",
    "曜日・時限": "金曜日1講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "加藤　恒夫",
    "到達目標": "知識：音声生成のしくみ，音声生成のしくみに基づく音声信号処理手法，基本的な音声認識の実現方法を理解する． 技能：信号処理ソフトウエアを用いて，音声信号を正しく分析し，特徴量を抽出できるようになる． 態度：音声学，音声信号処理，音声に関わる情報処理の課題に対して，適切に取り組めるようになる．",
    "概要": "本講義では，音声学の基礎，音声信号処理の基礎，音声認識技術の基礎を学ぶ．身近にある音声を科学的・工学的に取り扱うために，まず音声に現れる諸現象を捉え，次に音声生成のしくみに基づく音声信号処理の方法を学び，最後に工学的応用例として音声認識の実現形態を学ぶ． 学部講義「ディジタル信号処理」を既習であることが望ましい． 通信会社の研究所での研究開発の経験を有する教員が解説する．",
    "成績評価基準": [
      {
        "項目": "講義各回の課題",
        "割合": "50%",
        "詳細": "概念の理解，基本知識の確認"
      },
      {
        "項目": "期末レポート",
        "割合": "50%",
        "詳細": "概念の理解，基本知識の応用"
      }
    ],
    "成績評価結果": {
      "登録者数": "74",
      "A": "20.3",
      "B": "36.5",
      "C": "23.0",
      "D": "14.9",
      "F": "5.4",
      "他": "0.0",
      "評点平均値": "2.5",
      "備考": ""
    }
  },
  {
    "科目名": "ＣプログラミングⅠ",
    "開講学期": "春学期",
    "曜日・時限": "金曜日4講時・金曜日5講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "木村　共孝",
    "到達目標": "(知識) ソース入力，コンパイルのような操作や，変数型，関数，構造化プログラミング，配列のようなプログラミング言語Cの基礎を学び，順序，分岐，繰り返しで構成されるコンピュータプログラムの基本となる考え方ができるようになる． (技能) C言語による実装，コンパイル，実行が行え，要求される機能を持ったソフトウェアの開発ができるようになる． (態度) 要求される機能からプログラムを構想し，コーディングやデバッグを粘り強く行い完成させることができるようになる．",
    "概要": "C言語は最も普及しているプログラミング言語の一つである．C言語の文法を学び，実際にコンピュータを用いて演習を行うことにより，プログラミングとは何か，アルゴリズムとは何かの基礎を養う．本講義を通じてコンピュータに対する理解度を深める．",
    "成績評価基準": [
      {
        "項目": "平常点＋授業レポート",
        "割合": "20%",
        "詳細": "積極的な授業への参加，指定した課題の完成度合いにより評価する"
      },
      {
        "項目": "中間実技演習",
        "割合": "30%",
        "詳細": "講義内容が理解できているか評価する"
      },
      {
        "項目": "期末実技演習",
        "割合": "50%",
        "詳細": "講義内容が理解できているか評価する"
      }
    ],
    "成績評価結果": {
      "登録者数": "76",
      "A": "46.1",
      "B": "25.0",
      "C": "17.1",
      "D": "10.5",
      "F": "1.3",
      "他": "0.0",
      "評点平均値": "3.0",
      "備考": ""
    }
  },
  {
    "科目名": "ＣプログラミングⅡ",
    "開講学期": "秋学期",
    "曜日・時限": "金曜日4講時・金曜日5講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "渡部　広一",
    "到達目標": "C言語の文法事項について一通り理解できるようになる。 実践的なプログラミング力を身につける。",
    "概要": "CプログラミングⅠに引き続き，プログラミング言語Cの文法について講義をすると共に，実際にコンピュータを用いて実習を行うことにより，C言語によるプログラミングの基礎を養い，コンピュータに対する理解を深めることを目標とする。 また，より実用的なプログラミング実習を多く行うことにより，実践的なプログラミング力を養う。",
    "成績評価基準": [
      {
        "項目": "実習レポート",
        "割合": "60%",
        "詳細": "各項目ごとの理解度。相談可。"
      },
      {
        "項目": "小テスト",
        "割合": "40%",
        "詳細": "全体的な理解度。相談不可。"
      }
    ],
    "成績評価結果": {
      "登録者数": "79",
      "A": "22.8",
      "B": "21.5",
      "C": "36.7",
      "D": "16.5",
      "F": "2.5",
      "他": "0.0",
      "評点平均値": "2.5",
      "備考": ""
    }
  },
  {
    "科目名": "ＣプログラミングⅢ",
    "開講学期": "秋学期",
    "曜日・時限": "火曜日2講時",
    "単位数": 1,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "渡部　広一",
    "到達目標": "C言語による実用レベルのソフトウエア開発技術が習得できるようになる。",
    "概要": "プログラミング言語Cを用いた発展課題に取り組み，実用レベルに近いソフトウエア開発技術の習得を目指す。具体的には，コンピュータグラフィックスにおけるレンダリングソフト（ポリゴンシェーディングプログラム）の作成を行う。ただし，C言語の基礎は充分理解していることが前提となる。",
    "成績評価基準": [
      {
        "項目": "平常点",
        "割合": "20%",
        "詳細": "積極的な授業への参加態度等"
      },
      {
        "項目": "レポート１",
        "割合": "30%",
        "詳細": "外部仕様書"
      },
      {
        "項目": "レポート２",
        "割合": "50%",
        "詳細": "作成したプログラムの説明書とソース"
      }
    ],
    "成績評価結果": {
      "登録者数": "24",
      "A": "8.3",
      "B": "41.7",
      "C": "20.8",
      "D": "4.2",
      "F": "25.0",
      "他": "0.0",
      "評点平均値": "2.0",
      "備考": ""
    }
  },
  {
    "科目名": "ＪａｖａプログラミングⅠ",
    "開講学期": "春学期",
    "曜日・時限": "月曜日4講時・月曜日5講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "藤田　倫弘",
    "到達目標": "（知識）プログラミング言語Javaの基礎知識を習得できるようになる． （技能）プログラミング言語Javaによるプログラムの実装，コンパイル，実行を通して，基本的なソフトウェアプログラムの開発ができるようになる． （態度）プログラミング言語Javaによるオブジェクト指向プログラミングの考え方ができるようになる．",
    "概要": "本科目では，プログラミング言語Javaの学習を通して，プログラミングへの関心と技術を高める．Javaはオブジェクト指向の代表とも言えるプログラミング言語であり，コンピュータの機能を活用しやすい優れた特徴がある．企業の情報システムから組み込み機器まで，活用される分野は多岐に渡る．本科目を通して，Javaの基本的な機能を理解し，利用する能力を身につける． なお，企業内研究所での勤務経験を有する教員が，当該研究所で習得した技術を基礎とした演習を行っている．",
    "成績評価基準": [
      {
        "項目": "実習レポート",
        "割合": "40%",
        "詳細": "その回の授業内容が理解できているか評価する．相談可．"
      },
      {
        "項目": "小レポート",
        "割合": "60%",
        "詳細": "それまでの授業内容が理解できているか評価する．相談不可．"
      }
    ],
    "成績評価結果": {
      "登録者数": "103",
      "A": "6.8",
      "B": "32.0",
      "C": "39.8",
      "D": "17.5",
      "F": "3.9",
      "他": "0.0",
      "評点平均値": "2.2",
      "備考": ""
    }
  },
  {
    "科目名": "ＪａｖａプログラミングⅡ",
    "開講学期": "秋学期",
    "曜日・時限": "月曜日3講時・月曜日4講時",
    "単位数": 2,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "奥田　正浩",
    "到達目標": "（知識）Javaの基本文法とGUIプログラミングの基礎を習得できるようになる。 （技能）Javaを用いて基礎的なGUIプログラミングができるようになる。 （態度）JavaにおけるGUIプログラミングを通してオブジェクト指向の考え方ができるようになる。",
    "概要": "本科目はJavaプログラミングⅠの内容を基礎として，より発展的なJavaの機能について講義し，実際にそれを用いてプログラミングする。本科目ではJavaの基本的な言語仕様の理解を前提として，GUI（Graphical User Interface）プログラミングに取り組む。",
    "成績評価基準": [
      {
        "項目": "期末レポート",
        "割合": "30%",
        "詳細": "全体的な理解度をはかる。"
      },
      {
        "項目": "演習",
        "割合": "70%",
        "詳細": "各項目ごとの理解度をはかる。"
      }
    ],
    "成績評価結果": {
      "登録者数": "98",
      "A": "32.7",
      "B": "33.7",
      "C": "24.5",
      "D": "6.1",
      "F": "3.1",
      "他": "0.0",
      "評点平均値": "2.9",
      "備考": ""
    }
  },
  {
    "科目名": "ＪａｖａプログラミングⅢ",
    "開講学期": "春学期",
    "曜日・時限": "水曜日4講時",
    "単位数": 1,
    "授業形態": "講義",
    "実施方法": "面接/Face-to-face",
    "教授名": "小野　景子",
    "到達目標": "Javaアプリケーションを開発するために必要な理論的なバックグラウンドと実用的な技能が習得できるようになる．",
    "概要": "オブジェクト型言語の代表であるJavaプログラミングに関し，Java IとJava IIで学習した内容を踏まえ，関連するコンピュータおよびソフトウェアについて学ぶ．具体的には，サーブレット，JSP(Javaサーバーページ)，JDBC(Java Database Connectivity)，XMLについて学ぶ．",
    "成績評価基準": [
      {
        "項目": "平常点(出席，クラス参加，グループ作業の成果等)",
        "割合": "20%",
        "詳細": ""
      },
      {
        "項目": "JSPによるチャットプログラムの作成",
        "割合": "40%",
        "詳細": ""
      },
      {
        "項目": "サーブレットとJDBCを用いたe-commerceサイトの作成",
        "割合": "40%",
        "詳細": ""
      }
    ],
    "成績評価結果": {
      "登録者数": "23",
      "A": "47.8",
      "B": "30.4",
      "C": "17.4",
      "D": "0.0",
      "F": "4.3",
      "他": "0.0",
      "評点平均値": "3.2",
      "備考": ""
    }
  }
]